{"transcript":"Good afternoon, Arthur. Good afternoon, Dave. How's it going? It's going awesome. So I want to introduce Mike Cooper, who has joined the CompuTrek team and is in a very integral part of Everything from development on up, um, he's the. He's the ground and centered thinking of my lofty ideas. Well, it's a great honor to meet you, Mr. Cooper. It's good to meet you. How you doing, man? Yeah, and, and he and he and Chris know each other quite well as as well. So, um, I just texted Chris that the meeting's up and ready to go. Thank you for completing the assessment, Arthur. Um, it's amazing you scored 100% on being you. Oh, really? I don't know they have a score mechanism and I am really me. Yeah, and so you're a natural top performer for the aspects and that we're not gonna go over the assessments today because I still need Chris has got to redo his and then once we do that, then we'll come together and we'll see what future looks like. You know, today's context is really going over. The Core The MVP and not the most valuable player. It's funny in sports, MVP is most valuable player. Um, so what does MVP mean again in Minimum viable product, yeah, and so what I wanted to I wanna come from what's called. Abundance mindset. And so when I see the word, I, I get the minimal part of it, but I don't like the context of the word minimal because it like, let's just do the least amount possible. I want to be able to eventually have that mean maximum viable product. So we all wish to have the app just complete product to be built in one night. Yeah, the, the reason why they use the minimum word here is that it's going to be a product that with all those fancy decorations and supplementary features, it only present the functionality of the core features. So you have a brief idea of how the how the product is going to function rather than how the product is gonna gonna look like. Yeah, and I want to be clear, I am about the function, to me, functionality is context. The content, the way it looks, the dashboard, the rest, we'll figure that out as it needs to be, but it's, it's that part of it. So, before we start into this and give Chris more of a chance, I know you guys were finishing a module in your programming class today, and so I don't know if he's taking a break or And that, but yes, we actually have stayed up for stay up whole nights to work on the project. I think Chris will come, will come join us soon. So if you could just take a minute, uh, Arthur, and just, you know, I can introduce you by name, but if you can just give um Mike a little bit of a background, you know, a couple of minutes of just what you've done in life, what's led you to your journey where you're at now, and what looks like your horizon and hope, um, would be. Should you join Compyre and, and be part of that and by join, I mean, you know, you and Chris are development team and Again, there's no, we'll talk about licensing and down the road and it's your guys' a software in a sense that I may be licensing from you and we'll talk about what that looks like revenue and stuff. But anyway, just an introduction of some history of you. Yeah, of course. So my name is Arthur. Well, this is my, my English name, I'm originally from China, and I went to University of British Columbia in Canada. For a finance degree, and then I went back to China, Shanghai to work in an investment bank, which called Citic Security. It's like Goldman Sachs in China. And uh I worked as an investment banking analyst there for, for quite a few years. And then I did a short term transition to a VC capital to work as also as an analyst. So I have pretty much abundant experience with dealing with Excels, modeling, projections, due diligence stuff. And then I just decided maybe I should continue my studies, so I took a master's degree in Columbia University, and I just graduated. And during the meantime, I was participating in a startup project to build a consumer shopping app. And at that time, I just realized how how fantastic it is to work in a small team to actually build something from scratch and to create value for a very specific group of people. Rather than just serving as a gear in a huge corp, and that guides me to taking this boot camp, and that's how I met with Chris. And Chris just found out, OK, we have, OK, we, we are, we are the kind of people that we would like to work for each other, and we are, we're quite technically, maybe we have some gift in the in the in coding and we And one day, Chris just text me, Hey, I'm gonna do, I'm gonna do this kind of thing. Would you like to join me? I said, Sure, why not? And that brings me here. Awesome. Thank, thank you for that. Um, so do you mind if I ask a couple questions, Dave? Yeah, yeah, and then, and then when you're done, Mike, I'd like you to share a little bit of your history so he gets to know a little bit more about you as well. Yeah, absolutely. uh, but sorry, you went to UBC was that in Vancouver? Yes, the one in Vancouver. I'm actually now in Vancouver. You're in Vancouver now. Yes, my family are all in Vancouver. Oh, OK, OK, so I, I'm just in the Okanagan Valley. Oh, you're, you're in Okanagan now? I'm in BC, yeah, wow. So yeah, when you said UBC I was like, OK, we have a UBC campus here in Kelowna. Yeah, so I was like, oh, I wonder which one he went to. So, so there shouldn't be a language barrier since you guys both speak Canadian, eh? Yeah That's right. Uh well that's awesome. Cool. That's, that's great to hear. Um, and you said uh obviously Arthur is not your, your born name. Um, did you immigrate to Canada or were you actually born here and your parents immigrated? Oh, I was taking my education before high school in China and I come here for university, so. But I have the permanent residence in Canada. Nice. Yeah, I, the reason I'm, I'm curious because I've, I've I've met a few people who similar kind of lifestyles and uh I've always got to ask them because I know like Arthur is not the translation of what your name was, right? You pick it. So I'm like curious, what made you pick Arthur. Oh, that's a, that's a very interesting one. The reason why I have to make an English name for me is that my previous Chinese name is just very hard for uh for you guys to pronounce. So just to make everyone else's life easier, so I call myself Arthur. And the reason why I picked this name is just Like my high school English teacher told me, Hey, your Chinese name is too hard to pronounce. Can I, can you make yourself an English name? I said, Sure, why not? So I just open up my English textbook and find a page whose author, which article the author of that article is called Arthur. Hm, I like this name, so I'll choose this one. here I got the name Arthur and I like this name. Well, it, it has nobility. Uh, King Arthur is a great historical figure of, yeah. Yeah, because I, I do, I do listen to like thom times of the legendary of King Arthur. So that's probably why I'm keen on this name by the first time I see it. Hm, awesome. Um, yeah, so I guess a little bit about me then. Um, I was actually been born and raised in the Okanagan to BC here, um, spent 3 or 4 years out in Alberta in my youth. Um, but just came back here and haven't left very much, um. Yeah, I, I got into marketing. Uh, back when I owned a carpet cleaning business a long time ago, uh, just working for a guy, opportunity came to buy it, bought the business, um, this might be before your time, I don't know. There, there was a time when, when it came to marketing, it was like whoever paid the most for the Yellow page ad won. That was the simplicity of marketing. Um, but then there was this shift of the online world coming, right? And so, you know, I had to figure out the yellow pages weren't working anymore. I got to figure out this whole marketing thing. And so, uh, I spent a lot of time learning how to build my own websites cause a simple website back then, you'd be paying some agency like $30,000 for a website and it was like, OK, well, that's not my budget. So I figured out how to HTML code a website that was many years ago. Um, but what I fell in love with was the marketing aspect, the crafting of the language, the, the flow of content, how that works, and so that's continued to move forward as I not only the website, you know, learning about email communication and work flows and um online course building stuff now, so. So it's just kept on expanding, and a big part of that passion is is is learning about people because that's really what marketing is, zoning in going. OK, if Arthur is my ideal client, who is Arthur? How do, how do I Communicate him to the point where he says, yes, I want to buy. Right, I really agree with that. No matter what kind of business, what technology, down to the earth, it all comes to the end, which is people. It's how to interact with people, how do you deliver information to people. Yeah, there, there's a phrase that um you can build a great business with people. And sometimes it's, if it wasn't for the people, this would be a great job. Well, somehow that's true though. Yeah. Anyway, so, and anyway, continue, Mike. Um, yeah, that, that's kind of it, right? So, so I'm, I'm technically inclined, I guess, like I can learn stuff easy, but I'm, is this sort of place that I master any great skills in, right? Um, and as, as the years have developed too, like again, I learned enough to code to, to build a website, and then I started hiring out people to code the website cause it was like, OK, I know how to do it. I don't enjoy doing it, but I know enough to know when to hire someone what they're doing. And went down that route and then we started getting to the path where around that time it was, you know, uh, WordPress was becoming more popular, right? And it was like, OK, and, and, you know, now we've got everything's got website builders which just makes it really easy now, right? Um, so it's been really interesting watching all of that grow, and now, now you've got AI involved and it's just like it's almost too easy. There's no sweat in the game anymore. When it comes to building websites or graphics or writing content now, right? Like it, it's been amazing to watch everything grow in that in that way. As I will say sometimes overwhelming to see there's so many new things come out every year, maybe not every year, it's met every day. And there's always tons of things to learn if if people are in this industry. Mhm. But no matter how the industry growth, it all the the the like the key point is it's getting easier and easier to do things you want. So that's a good one. And Mike, if you could describe your last, you know. For near 10-year journey that you've been on. Um, yeah, so, yeah, so a part of, um, getting into marketing stuff was really interesting. Um, uh, I was doing that full time and then, uh, one of the local repair shops here that I had been using doing marketing with them, they introduced me to this program, um, that they were using and helped them out called Service intelligence. And uh basically I I spent the last 9 years and 11 months working for them. Um, with that, so that kind of got me into the automotive, foot in the automotive sector, which I really, uh, am enjoying and I'm really enjoying, um, really enjoying the teaching and the coaching aspect, not near the level that Kate that Dave has been coaching at, but, uh, I've really enjoyed that, um, getting to know people and one of the interesting things that Dave, uh, would be able to talk about too. Um, Well, I got to really understand people well. I wasn't knowing myself well, and that's really been the last year of learning about myself too, uh, which is It it's fascinating cause it's uh no matter how much you learn about people, but you, you, you don't seem to loon or recognize it to yourself, you know what I mean? Um, or you're blind to that almost, um. Yeah, so that's it's been a great opportunity last year to really learn about myself and start to go, you know, I really like I love not only understanding people, but There's this, uh, when you can lead someone to the light bulb moment. Right, where all of a sudden they're just like thing and they're like, I get it, and it's like, ah, that's what I wanted to see. Well, that's uh that, well, that's a very noble aim and For, for you, for you guys, both, both Mike, you and Dave, that you wish to, to guiding others to succeed through your coaching and consulting. I think that's a very good mindset and really, I really respect that. The one of the, sorry, go ahead. So one of the things that You know that I've I've been looking for a phrase. And Mike, you just said it, the light bulb moment, the transformation moment. The reason we would put whatever money, investment and time into our software, our, our app, our, our program development. It's in the end, the real end context is for light bulb moments. It's not for the sake of the KPI number. It's for the sake of the that what that KPI number can reveal in an individual for their light bulb moment. And so contextually, whatever we build is the end result ability to create a light bulb moment for somebody, cause I, I could build, I have a, there's part of me that built a bunch of stuff in Excel because it was really cool to build an Excel. But when I got done with it. I don't really use it. But it was fun to build and build the formulas and link the workbooks and do all that stuff. But in reality, I never really did anything with it when some of that was the bandwidth of the Lone Ranger, just me, myself, and I, and when we had a board meeting, somebody usually lost. And so it was like um when I'm by myself, I have all this. Understanding. And I can't systemize it, and that's really what this is about. And so what was intriguing about Mike and his past and career, especially the last 10 years, he's working with a software company, trying to get it to develop at a at a level 10, trying to develop customer onboarding, trying to develop training for them that was transformational in nature, and then seeing his heart to want to transform himself. It was very intriguing to have him now as a team member of us, and we just wanna make sure there's no elephants in the room. Service intelligence is Chris's dad's company. That's how they know that's how they know each other. And so, um, they chose to leave and they chose to approach me. I did not, I want to be really clear. I did not go, let me partly join service intelligence and steal their employees. That was not my, I just want to be really clear on that. Um, it worked out that way and it was kind of cool, but I, I think. Really Your background, what you just described, plus not seeing your assessment. The giftings and talents, and I come from a place of faith based, and I believe giftings and talents at some level, have some sort of a higher calling anointing on them. There's, there's a way, there's a reason we're given what we're given, and I believe our talents and giftings makes room for us, not just to make a buck, not just to create a widget, but I believe it's meant to bring. The light bulb moment is to bring light into the world and sometimes bringing the light in the world. We don't create the light, we let somebody else turn their own light on, and that's what this transformation is really about in auto repair shops. We're a different company. Uh, some companies train to content. I want a coach to result. I, I wanna to produce transformation. It's, it's just a different mindset. When we create a software. I don't want to create a software. I want to create a tool that transforms people, that has the ability to show people their light bulb moments. A software can't transform somebody, a coach can't transform somebody. In a sense, it's almost moving from the word coach to the word facilitator. Because our software is such a high level software, it's at level 10 or better. It's so powerful. Whatever mechanisms we use inside AI whatever you guys listed like 10 different kind of You know, technical features that Chris is very articulate in that I couldn't even begin to tell you what those are. But those mechanisms inside. Those are powerful and at the end of the day, did what we create, create an opportunity for somebody to transform. And and I think it's I think it's like this. If you look at Apple. Microsoft blew the doors off of Apple. But why is Apple pushing Microsoft? Because Apple wasn't about selling phones or computers. They were about transforming somebody's life. They were about the the intangible context of what that device in their hand, the device in front of their eyes. What could that do for their life? Microsoft is about, we have this feature, we have that feature, we have this feature, we have that feature. We blow the doors off of Apple, we blow the, you know, and it's like, it has nothing to do with it. It's like the auto repair shop customers, when they come in. They don't want to buy parts and labor with dollars attached to it. They want to buy peace of mind. And what I want to do is create a software that helps shops see. Clearly how to articulate that from different aspects in that. So I went down this deep intangible rabbit trail, and thank you for the patience with that. What, what I do want to move into, and I know um Chris hasn't responded to the text, so I don't know if something's come up in that, so I, I just want to move forward. Um, Chris sent me an MVP. Um, And uh I'm gonna, I'm gonna call it M2VP. Minimum now, maximum in the future. So, um, I want to share my screen and and go down that, then I want to show you the functionality of what the program does now because I think Arthur out of you seeing what I did, why I did it, you may go, oh, OK, and you being, and one thing my Arthur didn't share is he's somewhat of an Excel guru as well. And so he transforms Excel Excel sheets in the financial market that he was in. And I don't know if I articulated that correctly, but that was my take of what you had said last time. Well, we want people who can really accelerate, so yeah. So, uh, Chris did this really nice uh MVP uh specification. I just did a minor amount of editing in it and sent it back. I don't know, Arthur, if you checked your email, but I did see that along with your editing. So I just, you know, instead of a mechanic shop, I want to articulate elevate virtue of uh auto repair centers. I think this is spot on, develop a web platform. To analyze key performance indicators for auto repair centers, that's the objective. The purpose is a different statement, but truly capturing the objective, that's really what we want to do. Um, target users, obviously, you know, shop owners, uh, consultants management, cause now we wanna, oh, I didn't, I didn't put this in red. Um, but we want to be able to train coaches for for for pausing you. There's something, some problem with my eye is that I'm a color blind. So if, if it's possible, could you do me a favor to change the red color to something more distinctive from back? I sure can. Let me know um if this. Does blue work? Much better. Awesome. Well, good, cause then we're gonna connect to a good level cause my favorite color is blue. Nice. So, um, so auto repairs, so franchise it, we want to be able to take the software, have it so, have, have it, have the ability where I can train another coach and trainer, they can create their own transformational coaching company, but they don't have to work, worry about the mechanism that they're gonna interact with their clients on for accountability and what to coach on. Um, that's phenomenal. This is, um, this is your guys's language. I get where API. One of the things that we need to be cognitive is that every point of sale, POS, um, that a shop has, whatever their brand of software, we're gonna be able to have to interface with it, which means Uh, you know, I, I don't know what that means in the development world, whether we have a developer for a Mitchell software, a software, a tech metric. We have specialists that know that software in and out, and how ours interface. My experience with service intelligence was, we had a really good programmer. He was a jack of all trades and a programmer, but he, I don't believe we were a specialist in any one area. And uh I think, you know, we gotta be on top of if Mitchell. You know, 2 weeks in changes their UPI or API stuff. Hey, we're gonna move this box over here, and now ours doesn't read it. I want to be a proactive with Mitchell. Hey, what are you changing now? What's coming out in the next 30 days? Can we see it beforehand so we can test it, make sure it works in ours. So when you switch, we know what we gotta do versus right now. I'm seeing the reaction of Mitchell's a soft or somebody else changes or something in their computer program, and we're 2 to 3 weeks a month out, and we've got a dozen or more pissed off customers because we didn't play ahead of the game. So, um, I wanted to bring that up because as we look at API. Uh, I want it more than just, it's a data connection. It's it's, it's it I think it's gonna be more than just that. There's other things around that data connection. Um, interactive dashboards will create the sexy look of those down the road, um. This is all your guys' language. I'm gonna trust that it means something to you guys. That's that's very important for us to track on which technology we want to use. Yeah, and so I read that and I read Portugal. What are we doing in Portugal? So just a little bit of background on me, I have a little bit of ADD and dyslexia. So you may find I talk on a subject and you go, Dave, that's not what the word says. It says this, go, oh, my bad. So I may, I may launch on something that that's not what it meant. Um, success criteria is taken the Excel-based analysis, and I'm gonna go over my program very quickly, what it looks like without getting into the minutiae, the details, the reasons of it. Uh, timeline and budget, we'll get into that. So this was a great dec page outline of it, and then you guys go into quite a bit of detail. Again, I want to elevate virtue instead of mechanic shops, auto repair centers. Um, everything was good here. Um, there's portions of the KPIs. That however we however we pull the data, um, we wanna make sure it's accessible to future add-on modules. Um, like a technician's productivity efficiency numbers, we want that for a dispatching tool down the road. And so we'll go over the logistics of what each one of those are as we start developing this, but I just want to make sure that as we build KPIs, it's somewhere we can pull data in 3 or 4 different places at one time from that data. Hey, Dave, sorry, I just wanted to ask you, have you checked your waiting room just to make sure Chris isn't waiting for you? I know you don't always look at the waiting room. Uh, good call. Wait just a minute. Let me check my waiting room. Um, Uh, he's not. I'm gonna leave the screen up here cause then it'll trigger my shiny ball squirrel. I'll be able to look at it. Yeah, yeah, cool. But thank you for that reminder. Um, I didn't just put your hand up too, sorry. Oh yeah, I just want to, where, where were we? the extension, the extension of functionalities of additional future modules into the management outside of the KPI, right? Um, the thing is like There's a better way to explain the API is that it's not just the connection of data, it's like you have a data stored in somewhere else, for example, the data probably going to store, be stored in the, in your client's current software. And in order, if we want to, to evaluate the data or try to use the data to perform some analysis on our newly built software, we got to get the data from from their current software, right? And API is like a bridge that can help us to connect the data to connect with their with their current software to our to our newly built software. So that, that being said, that means that we can only work on the data that they have already have, we cannot create data from Void. Right, right, when the, when the API is built up, we are, I'm assuming that the software on the client side has some API endpoint for us to extract their data. With that assumption, for whatever data they have, not only KPIs, there, there could probably be data for employees, data for their, for their schedule, anything we can, we can pull all of this data with their permission and do whatever we want with this data. Yeah, and so here's where I'm gonna paint, if money or time are not an issue, I'm gonna paint utopia, the perfect world. The perfect world is, is we go. Pull data We, we go across the bridge, go grab the data, walk back across the bridge. We have data, we slice and dice and do whatever we want with it, make a tool, make an analysis, whatever that is. And now we have such a powerful tool. We go back, in one sense across the bridge, talk to the software owner and said, hey, here's our tool. Do you want it embedded in your stuff? And now, we create a software that goes inside of their software and they can up their subscription and we get paid off of that. So my goal is to is to be able to create a more powerful tool than what the point of sale has, so that they want that tool, and then now they, they broadcast it to 1000 people that have their software, or 5000 people that have their software, and we didn't have to sell or market to it, but the license for them to use us inside of them is now, you know, they got 1000 people and we get 10 bucks. A month from 1000 people. I mean, the, the revenue share is huge off that. Now, that's a different licensing agreement than like if I train a coach and trainer using our stuff. This is now going to point of sales. Hey, we have the CompuTrek scheduler, we have the CompuTrek dashboard. We have, we have this, only they can broadcast it. We have our new shop or Mitchell tech metrics dashboard, but behind the scenes, you know, powered by CompuTrek or whatever. They now have the ability to, without them having to reinvent the wheel, they're using us. I don't know if that's viable possible. I, I just think if our software is powerful enough, point of sales will want to use us. It's gonna be technically overcomplicated to build extension for every single clients because I'm assuming maybe different clients are using different software, right? They are gonna be very complicated to build a one for all extension for all of them. It's almost technically impossible. But here's a good part, if we're building our tools. On web-base, that means the client don't need to install anything into their local into their local machine. The other thing they need to do is to create an account in our web page, uh, import their data from, from, from their, from their own database, and they'll be use all of our analytical tools on our webpage. Does that sound like a feasible plan? Yeah, to me what your language there was like, that's the bridge we need, and whether it's they've pushed data to our site, we go pull it, whatever that bridge needs to look like, in the end, we just need data points to build what we want to build. And then so the the the API might be, like I said, we might need a a developer that specializes. With Mitchell, Shopwork, Tech Metrics, RO writer, all the different, you know, there's probably 2015 to 20 key players in our industry, um, and there's always new ones popping up, um, you know, software and tech metric, they're only been around for 10, maybe 15 years. They're new players on the block. And, and usually what happens most softwares. In the automotive arena for a shop to use. It's typically because a tech is really smart and he says, I can build a better software. They go build 10, people want this, and now they start marketing it and they grow it, and now they've reached capacity because there's still a technician trying to build the software and it doesn't work. Anyway, different road. So it's like one thing I want to add in there, is that right? Sure, um, just so that for Arthur knows, so a lot of these newer management systems, they're all cloud-based, right? So they are a browser application like you said, direct connection from their website to ours, you can build that with your APIs. Now there are ones that we would call legacy programs that have been around for decades, and they're an actual program installed on a server computer at the shop. So there's still, I, I don't know what would you think, Dave? I mean, half of the industry. I don't know, um, he still has these legacy systems, so that would probably require a program installed on their server computer to connect to our system, right? Right, so Mitchell is one of those, they didn't go cloud, um. Or a writer, I think is a legacy, um, there, there, there's probably. I don't know. I don't know current numbers for shop or all the cloud-based ones now. I don't know the volume of that number. That that's really clear, cloudy data, you know, they say that they're, they have this much of the market, but I don't, I think that's a marketing thing and not a reality. Um, but, but moving forward, so, um, so I want to get to the Excel, so you get a chance to, to see maybe some other ones. So the key features, um, There is a manual data um. There is a genuine need, and I don't wanna over elevate the need that's there, but what I've seen in shops, if I go to a shop. And the advisor is not putting their own numbers in. They don't have the change and shift in enhanced numbers as the, as an advisor who puts in their own numbers. There's a higher level of accountability when an advisor goes crap, I didn't do very good on that RO and I gotta go put it in, and that versus the shops that, well, my advisors are too busy to do that, and the reason they're too busy because they're not doing good advisory skills, another whole issue. So they take that off of the advisor and they put it into an office admin person, enters the numbers for them. Those advisors have lower KPI, lower transformation than somebody who does. Manual data entry. They're physically filling out a paper form. There is a left brain right brain that happens when you write something down. When you keystroke it into the computer, it's the the lessons from from heart to head are faster and quicker and transform better. Eventually, I, I would like that to be where once their numbers are at reach a certain level, then we're OK, we can turn on the automation. If they ever go below those marks, sorry, you're filling out the forms again. You want your numbers, you want to not fill out forms and put your data entry in, keep your numbers where they need to be. And and I get it this time. That's a powerful element. That's how I've mostly coached because I, I've only had maybe. A dozen examples of shops that didn't have the advisor put the numbers in. And those shops, they did have transformation, they did have increase. It came slower. Eventually it got to where it was. And so the reason I'm saying that is that I'm OK with Chris's note to not build it to begin with, but have the ability to have a manual entry down the road. I, I'm OK with that. Let's, let's, let's build it without it. If we're seeing a slower transition from how fast it means to transform the shop. Then Then while we, OK, we need a manual data entry in here cause they're not getting it without a higher level of accountability. Does that make sense? Um Uh, interactive cross-section data, so one not only inside, you know, location 1 to location 2, employee 1 to employee 2, if you, if a shop's got, you know, one shop or they've got 10 shops, data analytics, and for us as CompuTrek, I wanna be able to use. All my shop's data. To get industry benchmarks, industry standards. Does that make sense? Um, so that to me that was that cross section. Um, trust me, Dave, the, the one you said to, to get an industry benchmark standard is way easier than to compare a specific data of two employees in one location. Uh, I, yeah, OK, awesome. Um, The technical architecture, uh, yes, whatever you guys say, you're the expert, you're going through the training and that, um. I wasn't sure what hybrid user authentication is, but I'm gonna trust you guys there. So all the rest of this language down through here. Go for it, um, and then, uh, It was uh Success metrics. You know, we have the API interface, we got the manual data again later, uh, interactive dashboard. I want something that's really quick, interactive and to the point where it's actually not just interactive, it's proactive. Hey, we noticed your labor GP is off for this advisor. Here's the top 3 things, because of 15 criteria, their top 3 things to go adjust for Labor GP would be ABC. Another advisor, because of other KPI numbers that they are hitting well. Versus what the other one was, they may have 3 different top 3 things to go change a number. Both of them have the same underperforming number, but because of the other numbers around it, there's a different thinking that's gonna be or coaching be applied to them or a solution for them. I'd like to have that at some level. And I don't know if that's AI or if then type thinking that it, it, it pulls up, hey, this number's off. Here's the top 3 things, 5 things to go consider doing. And in that, and so that is gonna be some Dave experience, that's just gonna be um AI maybe learning ours. So I don't know. The interactive dashboard, I also want it to be a proactive dashboard, in fact, um. Let's do blue. Just so you know, my typing, I type in dyslexia. But, uh, I just want to reiterate what you just said to check if I'm understanding it correctly. By a proactive dashboard, you mean it's not just a thing that users to pull out what they want to see, but the dashboard itself suggests that users have what they should see. Is that what you mean? Well yes, and say, well, at goal your number would be here and I'm gonna, I'm gonna really open up that whole conversation in a minute with what's called forecasting. But the, because their numbers low, I want the dashboard to be proactive and say, hey, this number is off target by 10%. Here are solutions specifically for that advisor, that technician, that manager, the owner. Here are solutions or top criteria that you should be, or steps that you should be looking at. It's kind of a, a the proactiveness is a coaching response. Uh, best practices that they could go do at that point. I also do want it to do exactly what you said, Arthur. I want them to point out, hey, you were supposed to produce, you know, 76% La GP you only hit 3 73% La GP, which is a huge number. Sounds like small 3%, but it's a huge number, um, in that. So I do want them to see where they're at compared to Gaul. And, and, and I'm gonna open that part of conversation up here in just a minute. OK. OK, um. The rest of it, and I get the reservation about the interactive manual interactive there, uh, we talked about that. This machine learning integration is kind of this is part of that proactive dashboard, is part of that as well. Um, project timeline and budget. This is something that I have no idea how long it will take to build this. That's where I'm gonna rely on you and Chris and knowing from the MVPs, um, M2 VP minimum maximum, what's it gonna take for minimum, and minimum being maybe not necessarily the least amount to get by, but what could we do in stage one, stage two. We believe this is a 5 stage, 10 stage. Development project. Here's stage one, and part of the evaluation, what we would call stage one, and then this is where I'm gonna rely on Mike as well. We call it in, I don't know, have you heard the term low hanging fruit? Not really. So, so like when a farmer goes out to a a orchard of apples, it's really easy to grab the low hanging fruit. I don't need a ladder, I don't need, uh, you know, high climbing things and different tools, and it's a whole lot more effort to go get that higher fruit. I'm gonna go after the easy fruit. So stage one should also have maybe a context of what's the low hanging fruit, the easy fruit to get to turn on cash flows, so we can go by the ladder and go get the higher level fruit. I don't know if that's a good analogy or not. That, that sounds correct to me. Like if I'm actually what you just said is that is exactly matching the idea of MVP. Uh, how does that work? Uh, let me use another analogy. Imagine if you want to build a car, what's the thing you're going to build first? It's going to be the bottom of the car with the 4 wheels. Right, right. So the bottom of the car with 4 wheels is the MVP is the, it's the key functionality of a car that makes it a car. After you make a you make a what what what do you call the under part of the, of the car. What is what? what do you call the under the the the the plate with the four wheels off the car, is there a name for that? Well, you have the powertrain first and then you build the body on top of it, the chassis, so to speak, the yeah, you, you build the, you put the sexy bumper on it, the, the chrome and all you, you fluff it up after the basic powertrain, it's all fluff from there and that and so. But great analogy, super great analogy. If there's one thing different from the, from the, the lower hanging lower hanging fruit, and this building car analogy is that When we're doing with MVP, the viable means that we're gonna, we know, regardless of the difficulties, we got to pick the most core and critical functionality to build at the first. Otherwise, it's not it's not even a project we're looking for. Yeah, what I don't want to do is, OK, I got a car door. Now I want to build a car around it. That's not what we want. We want to start with the core functionality. And after that, after we have the four wheels, we have, we have the, we have the bottom, we can start building the shell, the seat, and maybe air conditioning system which and extension features on it. Yeah, make sure it has a cup holder. Yeah. Of course. Um, and so in the conclusion, so this was, I'm, I'm really glad Chris brought this out. It didn't matter where he got it from or whatever, it just, it brought a lot of clarity to me, so I really appreciate that. And I'll go through, I'm gonna, I'll change things to blue. I'm not gonna take the time to do it now. I'll change them to blue and resend them. Uh, what I wanted to do now is I wanted to go into um. And I'm gonna do it here. So right now, the current Excel is version 4.70, and it started back at 1.something. And every year, I just take it up like 4.7. Next year would be 4.8. And sometimes halfway through the year, I go 4.75 because I made a major change. I had an epiphany and stayed up till 3 o'clock in the morning, changing expo. Anyway. So inside of it, we track 5 advisors, we track, we have an appointment dispatching system, there's an instruction manual, um, there's a management file folder that has the forecasting built in, but we fill out the advisor 1 through 5, the technician dailies. We have a recap here of where they are for the month. And so I'm gonna go over some, I'm gonna show you an end product. Of a shop that just sent me their numbers because I think it might be a little bit more. Uh, revealing And I'm gonna go to this Excel. So first service advisors and business management, each one of those advisors, they fill out their daily workbook, and it has the number of days um based on what I forecast planned for them. Forget about the logistics of that. But it lets me see month to date on this day is day 17. Of 20 it lets me know where each individual advisor is month to date. As a month to date total, I then get to see, are they at goal or not. So in the forecasting program, here's their KPIs, the 1513 to 15 KPIs that they go look at. They put data entry in and this auto loads this recap workbook. This recap workbook is where I spend probably 90% of my coaching time with service advisors, owners and managers. This is, these 13 to 15 major KPIs are where we go make a lot of transformation in a short amount of time. I'm manually now. It's only when coach Dave physically is present. Talking, reviewing these reports with the owner, do they have insight for transformation? I want to get to the point where we're not using Dave's time to do that. We've got our system is doing that. At at the the other realm of it is there is um. I don't know if I've opened up their. There's one for the technicians, so service advisors who greet the customer, write the repair, give the repair to the technician. Now they go actually fix the car, diagnose the car, service the car, give it back to the advisor, and now we can see on a daily basis, we have their daily numbers. They are tied into a forecast, which is kind of what you were talking about earlier. Does it tell them what number it should be? It does. We should be doing 9 hours a day. Today, um, William was off by 67%. Month to date, he's 0.8% above goal. So this is a kind of intuitiveness that I uh I built into it based on. Um, comparison thinking. Um, but what it doesn't do is like, um, this guy's 92% off. I don't know, tech number 2, I don't know that is he off because of diagnostics, preventative maintenance? Is he off because his, his DVIs don't have enough pitchers? Um, there's, there's so many criteria of where we need to go to go get another roughly, you know, 8%. That's where I wanna be able to build the system eventually. This is probably not the minimal, is to give the data feedback. Right now, the minimum is I want some sort of a data extraction. It the dashboard would turn into a color. Typically green is that goal, yellow is within 10%, red is over 10% off a goal. Typical stoplight. But I want some sort of a target that they're supposed to hit. So that's the technician part. I'm not gonna go into the logistics of that. Um, and then the other. realm is, it all starts with this workbook. This workbook, the forecast and setup, in fact, let me explain it this way. Cause eventually, you guys will get a copy of this and where to pull from, but in the management file folder forecast, this workbook is the heartbeat of my tracking program. Inside of that workbook, that which is this workbook, at the beginning is an index, and so these are hyperlinks to each one, you know how Excel works that way. The light green is where they enter data in. The yellow is a management forecast that shows deep financial numbers we don't necessarily want employees to see. The lime green are the advisor ones, and then the olive green or, and I don't know if you can see the different colors there, but these are for just the tech, hence they're labeled uh tech in there. So we go through each each shop, we go through, um. Original shop numbers, we load their data from the previous year. Right now that's a manual thing on my part. What I want to have happen is that it went and calculated all last year's numbers, auto loaded it in here, and I didn't have to do that. Um, and then same with their technician numbers. What did each tech produce? How many hours were they were available hours? And now I get reasonable sold hours. Um, we set up their workdays. This is a manual data entry. Hey, this shop works opens Monday through Friday, and they go put in, what holidays are you taking? They go put them in. They're doing the holidays and I'm not scrolling through and reformatting, you know, there's 31 days in each one of my workbooks in case somebody was gonna open 24/7, 365. I have to manually do this year in and year out, which it's, it's not as tedious as it. It is, but I, it's still way too much time for that. We, we know what days are gonna be there. Um, I'm not gonna skip that one. There's, I'm not gonna skip that one. We set up the technicians, we start management training with this workbook. This workbook lets us fundamentally see. Based on our business model, the strength of each tech, this tech will do 9 hours a day, this one will do almost 12, this one will do almost 10. This one is apprentice tech, he's not even gonna do 5 hours a day. Based on those numbers and criteria as a global here, they, they'll have their benchmarks, um. We even calculate, you know, how many days they're gonna have on vacation, days are gonna be missed. Um, each month, this is a critical part. I shifted about 7 years ago now, instead of just a global. You know, hey, they're 90% of the time they're working in cars, 125% efficiency. We got enough work to keep them busy. They're gonna produce 9 hours a day. I did that for each month, but what happened is, is that we're growing techs. So this particular one is even across the board, but actually, no, it goes from 9, 9.3. Uh, 9.7. So we, over a year's time, we, we set different goals for this tech criteria to be at. So I want some sort of a month to month forecasting element for each individual technician. I also want month to month criteria, forget about what the numbers are for each individual advisor, like advisor one. Here's all the criteria for advisor one, is that shade, this shade is advisor 2. We set the metrics of what they're gonna do on an average reparator each month, and are they growing through the year. Um, and then based on those numbers, I'm gonna skip all this other stuff. Those numbers yield what's called the manpower analysis. 4 texts, 8 hours a day, 21.3 working days. It does the math and it lets us see at the end of the end of the month, we're gonna average this year, 282,000 sales and GP on a 12 month we're here because it's the year total. Um, if I come to like January, it gives me just January for the service advisors and managers, all the sales and gross profit, um, just the cogs element, not direct expenses, we typically don't let employees like technicians and advisors see, um, this kind of thing where they see like a typical P&L, that we don't let them see that. That's for the managers to see. Um, but then, uh, Anyway, it kind of, it gives it, it's the goal setting. So we set the forecast, we set the technicians. This is where, this is their forecasted daily goal. This is where those numbers are what show up in these numbers here. And that for them. So that in filling this out, they know immediately or they see the numbers, they see where they were out for the day, they see where they're out for the the the um the month. Um, let me kinda do some really quick other wrap up. Um, so inside of. The bass copy track. Then inside of here. Um, analysis, we've got major analysis report. I don't have a live one. Uh, teed up. Um, but that recap, that's each month shows up here, we can see each month to month, where we at, where's our year to date, um, average, if we continue this, where are we gonna end up? And so, oh, that's one thing I wanted to show you. I want, this is to me is a critical thing, because we have. Um, I'm gonna take the context of this. We set forecast all the blue. This is their month to date total. This is the shop month to date total. We're day 17 of 20. If we continue the same trend to the end of the month, this is where we're gonna end up. Right now we have 64, we're off by 91 ROs for the month. If we continue that trend, we're actually gonna be off by 108. So this is a critical thing of getting shops to fix the month in day 5. So you'll notice that all my workbooks every 5th day is a is a different color, and the reason of that is the trends of a month start day 5 through day 7. Depending if the 1st of the month is a Monday, or the 1st of the month is a Thursday, day 5 to 7, the trends of the month set in. This is where we are super high intentional in transforming that shop. So whatever we build software, it's not only the critical data on that day, but month to date where are we? And if we continue, this is where we're gonna be, and this tells them you're, you're, we gotta work on car count and day 17 of, of 20 that they're on, um. They're gonna be off by 107. You can't fix that month in 3 days, but it's got to be more intentional. So, so Arthur, what I'm saying there is that contextually, I want to steer their ship, day 5 to day 7, typically no later than day 10, of where they need to go to fix that month. I, I pulling a rabbit out of the hat for the magician, that sounds great. You can't do that the last week of the month. So all of those go into um. Hold on here. There's, there's a whole bunch of different, this is just data points analysis and what and what we do with those. So the base comperrick has one last element, and that is the dispatching tool that may not be the minimum, but I believe it should be something that's stage 2 or stage 3, because I think that's gonna be the differentiator of our software is to set us apart. What that looks like is this. And I don't think Chris has even seen this. So I know that my tech, here's their daily goal, sold our goal, and right now this measures based on what I put here, I'll show you that in a minute, it tells me how how close are we as service advisors marketing, how close are we coming to meeting that goal at the front counter before it goes in place. So for example, and this is tech number 2. As soon as I put in tech number 2, it shows me what we believe his fork, his efficiency is gonna be. So if I put in, let's say that's a. Uh, a 7.5 hour job. It's this tech historically does that job in 5.2, it only reserves 5.2. And the reason we do that is because this particular tech specializes in BMWs. Nobody else does, so I need to know as an advisor, if, if number 2 is my BMW guy, where could I put another job in there? I got a guy calling in who wants 8 hours worth of work, you know, I can't just bring him in this day, I could bring him in, but I gotta, I'd be carrying it over. The other thing that this does, it's unique that not a single scheduler in our industry does this at all. If I have a second job for tech number 2, again, it knows he's at 145, and say a different advisor upsold and did a job for so he say he sells a 10.5 hour job. Excuse me a minute. He sells a 10.5 hour job. I got 12 hours. Well, he only works 8 hours a day. Every system out there does not do this. My calendar goes in at reserves time here, that here's his carryover hours. Here's the deal. My math is already off because He's actually gonna do this job in 5.2 and 7.2, that's 12.4. So 12.4 is here, but when it carried over 75 and 105, Um, is what is that? That's uh 1718 minus 8 hours. Means I'm, I'm over by 4, so I got. I, I have a math issue on my own one, but anyway, I just saw that earlier. All that to say is that what I need is some sort of a deal. When I set an appointment for a customer, whatever the retail hours are gonna be, it knows its efficiency. From an overall global is what this is now. The refinement of that is there's 3 labors in a shop, diagnostic, preventative maintenance and repair. Each one has a different efficiency. Each tech will do those historically at a different efficiency. If I know, like this guy, average wise, he does 145% efficiency, but on this particular job, say it's a, you know, uh, a water pump. AI would be able to go into their KPIs and look at their numbers and go whenever he does a water pump on this year, make and model. Historically, he runs at 200% efficiency. It would adapt to that year make and model of what he's done in history. If it's never done it, it would default to the blanket one that he typically works on as an average. Does that make sense? So the, the reason I do this, I'm gonna come into context. Forget about the logistics of how it works. The reason I do this cause if he's my BMW tech. And advisor A sold this. Adviser B said, Mr. Jones calls and I got a BMW. Can you bring it in on Thursday? Um, you know what, I think, you know what, our BM tech, BMW tech is full. Um, our next available for drop off would be Friday, but then you'd have the weekend. So really our next available time for him. Um, is Monday. It allows the advisor to book appointments appropriately for live workflow. There's not a system out there that does that now. And I, this can, this is probably 3 to 5 hour conversation of all the criteria around that to build that. That's not stage one though. I just wanted to show you that we need to get that kind of data eventually from it. The other thing uh realman here is that in this one, is we actually code every customer based on marketing codes, and we do a very robust analysis. I don't even think, Mike, I've showed you this. And so, um, there's some powerful analytics that come from coding. Did that customer, new customer, word of mouth, different sources of new customers based on repeat customers. How many cancellations do we have? How many reschedules? Mike, you and I got to talk about what that looks like, what we really need to go after. But when you see inside of the folder. This appointments 45, just means it's 45 lines and 6 technicians. So as I look at the. The report here. I've only got a spot for 6. I have another whole workbook that I can use 10, but I haven't elevated the 10 because I have very few shops. I think I have maybe, I have no active clients now that have more than 4 text. 95% or better of all my clients historically are 4 texts and less. We typically generate from that. Each year, they'll have another 300 to 500,000 of new gross profit in 12 months from what we do in this manual system that sucks the life out of Dave because I got so many hours into making sure Excel works on their network. I have to build this because this is a shared workbook from technology of 1995. And I never changed Excel works work. Sharing a workbook on the network, it's in the old format, and I know they updated it, and I didn't even want to look at it. I, I was in resistance to that change. So I have to put, when I load this now. Every but all these workbooks are linked to that forecasting module and 3 or 4 sometimes other workbooks, 5 other workbooks. It has to be done on a Z drive that's mapped in order for this workbook to be shared with the old sharing principles inside of Excel. I'm tired of every year. It takes me 1 to 2 hours to load a new tracking system on a client's computer, remote in, validate all the links, and then have to protect the workbooks so that they don't enter where they can't enter. So I'm trying to spell a little bit of my pain points, so that that I want to get away from that. My time is too valuable now. Uh, I'm Dave, um, 64.8 years old version, and I don't have a lot of, you know, my time is valuable. I want to get to transformation. I'm tired of doing logistics as much as I love strategy, tactics, and angles. It fed my ego, it fed fulfillment to build Excel spreadsheets with links and travel all over the place. I don't need that anymore for life fulfillment. OK, with that, What did you hear me say? Well, Just, just, just not sure on the technical side for whatever you're building this Excel will be able to transform into into the app. And the key, like the, like the pimple you said, your your time is valuable and the key, the main purpose for us to build this is to save their time to do the work on the logistics so you can use more of your valuable time on to on to personally coaching uh inside the store. Yeah, absolutely. And this software that we're building, and Chris and I had some conversations, I forget, I think we might have alluded to it last time, but you have any business model where you have a labor hour being charged and parts with it. This application can work for electricians, for plumbers, for you name it, anything with labor and parts, this software will transcend into that. And so what I'm asking from Chris and you, and, and obviously you guys are having conversations of what, what it is you're doing as a joint venture together, a company, um, Whatever that looks like, then. The CompuTrek I don't wanna say proprietary, but it may be proprietary, but it's, it's gonna be what we do with that. You guys will build that and have the freedom to use that in whatever industry market, whatever global market you want to use it in, brand it however you want. And for that, you guys get residual off of what we sell. There'll be development costs, obviously, we pay you guys to develop it and, and that, I need some sort of a bandwidth. The scope of of development. Dave, we believe it's gonna take this much dollars and this much time to do the MVP and we might even have MVP, A, B, and C. That that might excuse me, might even be broken down. Did that give you a better understanding of what I have for Excel right now? Does that kind of give a Oh yeah, that's that's what I initially want to ask you today to see how the Excels look like to have a like fundamental, like a very, a very basic estimation of the workload and and and the aspect or direction we want to work on. So yeah, I have a way better understanding and the big picture now. So the other realm is that we have, uh, this is even other API numbers. So now I'm gonna come back to This one because. Besides point of sale, inside of the forecast. Is we do all the green light green tabs. The yellow start filling and what is, what is payroll gonna look like for them? And then we have what's called, um, I call it a cash flow sheet, it kind of is, um, it basically it's a P&L and based on additional things. Paying off debt, cash reserves, um, net stockholder shares, um, we get a chance to see what is their cash flow is gonna be. But then once we set their forecast, their budget, so just, just for clarity too, if you hear me say forecast, I'm talking about sales, cost of goods sold, and gross profit or you, I'm, I'll say GP for gross profit. When I say budgeting, I'm now talking about the fixed operations expenses that historically don't go up and down. Once we have the budget, now what we see is each month, My shops, they manually put all their numbers in here. These numbers can typically come right from the point of sale. These numbers, however, come from their accounting software, QuickBooks, Quicken, Peachtree, um, Microsoft has got some, there's some free software for accounting that I can't believe shops are even using, cause it's so minimal pathetic, it's ridiculous. Typically, most shops have QuickBooks, but a way to tap into QuickBooks where it auto loads this data. Here, and then once we have this data each month, we have their total, we have their average, and now I get to see not only how far sales are. I get to see, manage their expenses with them, um. And, and, and gut level honest, I only have 2 or 3 shops. Ever filling this out. Um, they They lack the time and the discipline and the passion to do that, because we're so focused on this top up here that these numbers here, the recap actually gives us the analysis here. It gives us all those numbers, all those top numbers are this here. And then this one has A report card. In a 12 month, this is their starting average. And now I get to see how much new GP did they create in 12 months. Their trajectory. If they continue this trend, this is how many new GP dollars. So I know early in the year what we got to go work on based on criteria. Yeah, I get, there's no numbers, it's, it's, we don't need to know the math, but I want at some point. I want a global, how much new GP dollars have you created? The reason I go after GP dollars, Arthur, is because. It's one of the numbers that lets me leads me to the thinking that's keeping them stuck. Sorry, I'm running out of breath. So we are at about 1 hour and 15 minutes. And so I don't wanna take much more time. I'm, I'm, I'm hoping that you see a good understanding. Do you, what questions do you have right now? Um, That you wanna ask. Well, Honestly, like, regard regarding the whole functionalities of the of the Excel spreadsheets. I, I, I gotta be I gotta be honest, it's too much information there. It's a lot for me to digest. I don't even know where to start asking, but what I want to say is it doesn't matter if I cannot I can't understand it or not for at this time, at this moment, because I'm definitely going to spend a tremendous amount of time to figure out the logics behind all the all these spreadsheets when I'm trying to either to replicate or to implement the functionalities of the spreadsheet into the Into into our tools. And from now on, what I, what I can tell is all the logics here are, are, are transform transformable into a software base and I can see the way, I can see the direction to how to make those whole like to make the whole workflow to be more. Easier for you to evaluate, to, to, to type in the data to see the results, and to, to play with the, with the data analysis. So, in part of it, and so I asked that question now, if you had some now, great. What I'd like to do is send you a recording of this, so you can watch through it again. But then also, um, and give you and Chris, and I don't know if Chris still has it, probably not. But it's to allow you guys to have all the Excel, and then if you wanna, OK, what does this number do? It it, you know, and you know Excel, you look up in the formula bar, you can see where it goes. Just so you know, for the links to work, my suggestion is you create on your your C drive, you create a file folder called CompuTrek, you download this 4.7 into there, you create a Z drive, map it to that CompuTrek file in your C, and, and only open it in the Z drive and not the C drive, and then all the links should work OK. If you just load it on your C and try to open it, it's gonna say missing links you won't see the links. I got it right. I'll, when I, I'll type out an email, um, kind of a step by step to do that. Uh, your computer savvy enough, you probably understood everything I just said. Um, But with that, so open up from a Z drive, um, so that it's everything can be actually read. Um, So I would, you know, I'm, I'm glad we got to spend one on one. It would be, uh, obviously it would have been great if Chris is here because he'll have some other interjections. So, Chris, as you listen to this, cause I'm gonna send you the recording, you know, what questions do you have from an MVP M2VP Minimum now, you can see maximum. I haven't begun to talk to you about maximum yet though. There there's other things besides the dispatching. There are other elements. Actually, they're probably not additional elements, they're deeper elements of what I talked about. The proactive dashboard that gives them education response, cutting my time out of the picture, the interaction to to make sure that whatever they're doing now. If they continue this trend this week or this month or this year or this quarter, this is where they're gonna end up. Now we feed that data, OK, or the educational part, this is how you go fix that. Um, but I also want it tied into. Forecasting at a deeper level than I've ever done before. I wanna be able to go find out that technician A, when they diagnose a BMW, a Ford, a General Motors. It takes them each one they might do at different speeds and levels, and I wanna be able to analyze that. Well, why is it, why are they so much slower on Fords? Well, we're not using a Ford specific scanner, we're using a universal scanner. We don't have all the data, and it slows down us fixing the car, or whatever. That's, that's a different one. Yeah. So my, based on what I've said here, and I know you kind of were in and out, so you hope you cut most of it, is there anything else that you think Arthur and Chris as he listens to this? That maybe I've missed that we haven't talked about the context of software, what we wanted to do, the ultimate maximum value, um. Product that we want to create that I haven't mentioned. Yeah, I don't know, as you said, there are some things on here I've just not seen before, right? Um, there's a lot here, and I think again as we're looking at the minimal viable product or stage one. Um, I think that needs to be, uh, yourself or you and me to. Kind of decide what's the what's the first thing that we can use to either sell as a product or Saves you time. Um, you know, what does stage one look like, cause, cause they can't decide which one's the best, right? So we, we gotta establish that so they know, OK, well, stage one looks like this. Yeah, and so I'm glad you said that cause I just thought about that. So as we look at, you know, all this forecasting here, all the green tabs are probably gonna be MVP one. Um, so that we can forecast. And deal with this section up here as number one. Cause we course correct this, we're gonna course correct a lot of this stuff. This would be MVP 2 down the road to get there. I think now if we put a portal. That we can interact with them. Forget about the, the coaching tips that come with it. That would be MVP 1, MVP1A would be, let's get this in, polish, subscribe, build some abundance, build some subscriptions with it, and then we add in the coaching part of it, and then we add in the expense part of it. In the meantime, I can still coach one on one clients this level should they choose to go to a a coaching package. I can still do that on a manual basis for now. But ideally contextually wise, the sales and GP. Portal software to me would be that minimal vile, viable product um right out of the get go. And, and integrated with, we have the ability to go set each tech each month, how many hours a day do we think they're gonna be able to create, include their absenteeism in there, and then um for advisors. We have how many hours per repair order, the labor rate that they're at, um, all the sales goals from a place of gross profit percentage for the different labor sublet, tires, the rest of that. Their average RO overall GP. And then I also this, um, I will touch on this real quick. So we know the techs are going to produce a certain amount of hours. However, we don't sell just those hours because if the advisor has a 70% closing ratio, his goal is 165 at the end of the month of sales, 105 in GP. I don't want their focus on 165 because he closed 70%. 165 is 70% of what they should have presented. This is where Mike, this is key critical. I don't know if I've gone over it before, but this is their sales goal from a place of marketing. We want this one advisor wants $235 ability to present to the customer. Then we have advisor number 2, we want $206. So marketing is 206 and 235. So what is that? 2441. That's our marketing goal. That's our workflow management goal. We've got, we've got to get that work in the door, so this guy closes at 70, and this 1 may be the same, and 70. And because they're at different hours for repairs why their numbers are different. But where I'm going there contextually, I, I wanna be able to help an advisor like this particular one, it's the same. So I might be 3.5, 3.5, but then Then go for. For there and then go 4.5. And now we're growing this tech to be our advisor to be 4.5. Well, as you can see, his RO average climbs throughout the year. And and we we put more um throughput for the shop or whatever. But the, um, anyway. Sorry, I, I wanna make sure I don't go into features and get into that cause we're still in context. Language negotiations, what does that look like? Go ahead, Arthur. Yeah, that, uh, so here's how I think about this, uh, the, the whole models here. We technically we typically have three kinds of Three kinds of sheets or spreadsheets. The 1st 1st kind is the sheet, the spreadsheet that I use for data entry where you enter the data. The second kind is the spreadsheet for calculation. It's where you're, you're doing the calculation and manipulating of the data. And the third kind is a spreadsheet that used to present the result. And for the, for the, I just, just, this is the add-on to, to Mike's question because that's exactly what I what I want to ask is that we just, we just defined the scope of the MVP version one, right? You want, you want to have the, you want to have the, the, the, the result of the forecast to be presented. So I just want to take a look at um where are you where are you entering the data you're right, and I totally forget. So this is in 11 means advisor 101 is January, 02 is February because my formula's got to be so long, I couldn't actually type out the month because some of the formulas were over 255 characters that you could put in a cell and so I maxed it out so I, I had to truncate it. So this advisor one, and this goes to the forecast, it would actually put their name up here, but he puts the RO number, the uh the actual hours of Techca, the sold hours, all the criteria we need from API numbers, the main core criteria are gonna be these numbers here. The main core criteria, and then who was the tech that worked on it? And what kind of customer was, this is a marketing column, and then I want to know when did the RO open? Basically, when did they check in? Not necessarily when the RO was created because if they prepped a repair order, but the appointment's not for 3 days. I want, when did the customer come in? When did they leave? How long did we take to process that repair order? So, data entry for an advisor is just these columns here. That they fill in data here, and then they fill in data. In these three columns, and then it slices and dices and does, this is all tied to forecast. When I built this, I thought I would be using this a lot daily. I hardly ever use this data down here. All this data, oh, and just so you know, um. You will see on day one, do you see where it goes from line 37 to 53? There's some hidden stuff here. Um, Unhide On day one, and so all this number goes to the forecast and setup. Originally, this was a manual enter every month, and then I tied it into the monthly percent variables. So whatever you change the advisor percent monthly variables, it in January, it shows up here uh related. These numbers are what this uses to calculate. Um, for a technician was this page that I showed you the filled out one, but every day they filled what was their unapplied time and reasoning. These titles are part of my forecast or workbook. We can change these titles inside of the forecast, that's another whole mechanism. But how many hours did they produce that day and how many hours were they available, and then it slices and dices, and it lets us know compared to goal. So data entry for technicians is here, data entry for advisors. Is this workbook and it's all done through here. I have a a version too. That It's way more involved, it starts turning these color, like, for example, if I type in, let me show you how it goes here. Um, and I'm just gonna do. Um, and let's just do 150. No, that's, that's not enough. Uh, let's do uh 4:50. And parts sales, let's do 1000. And make it really easy. What's our goal there 55, so I'm gonna put uh 550. Um, And sublet sales is 500 and cost was 250. Um, anyway, so every time I put numbers in, it starts turning things colors, and then, um, that I'm not gonna go into that. There's a whole lot and anyway, but then we put their mileage in, and then we put in what work. Did we present that didn't get sold? And it, you know, we got $1500 that we didn't do. The customer spent $3000 but we didn't have 15. I want the adviser to be able to put a note in there. What are we doing with that? What's happening with it? It's booked or not, or that there's so much more that goes into that. So as they're entering data in, only if they had sublet would they ever enter in, only if they had tires would they enter tires in, then hazmat and fees they would put in. Then all that shows up again that comes back to. Not to this workbook, this was an actual client's live workbook. It would come over here and and month to date it would fill it in. This shop right now is on. This report was for day 17. This is dynamic diesel, by the way, Mike. Look at their hours of repaired. They're rocking it, yeah, they're, they're rocking they're diesel shot too, right? So it's a bit more, yeah, it's, it's more, but still it's, yeah. So, um, and I, we need to kind of wrap up because I'm getting a little bit of a optical migraine from looking at the white screens too long. So with this, let me, let me do this, um. I'm gonna send you the recording of this, and What I'd like you guys to do based on the recording what you've seen. You and Chris have a conversation. OK, we kind of have a good understanding of what MVP 1A 1B1C would look like. Um, what is it that you guys believe? It would take time, effort, energy, including, um, especially time. You know what? Yeah, that MVP one, we could probably build that in 6 months. You may not know that until you finish, you graduate from your course when. Add the early May. So, and and I get we may not have a viable solid answer because they're gonna keep training you modules, and you go, oh man, this is how do we do that in the next module? Oh, there it is. And so I, I get we may not have a finalized. Good estimation of what it might be, but if you could have some resemblance of what it would be, and then dollar amounts, what you guys want as a company to create that and effort and energy, and cause that gives me a target. Either internal sales or go get funding to create it. Um, I don't have a problem going in and get funding. I just wanna make sure we have a great ROI. We have a path. I, I trust, explicitly trust Chris on his organizational skills, his direction, his focus, his integrity, and the fact that he's recommended you is huge for me. Um, I've seen your assessment. That really impressed me. I mean, Arthur really impressed me. You, you're the right person, you're naturally wired to do this, and we'll go over what that looks like later, you know, as we, you know, as we sure for sure have a, yep, we're choosing in, we're gonna do this, we're committed to this and doing and doing it. Whatever that looks like, how we come to that. I would like to have Some sort of a, I don't wanna say fast track, but, um, obviously you gotta get with Chris. You've got new modules, new projects, you've got a lot on your plate. You and Chris talk, and if you could have something by maybe, you know, Tuesday, to know, hey Dave, we talked about it, we believe this and that, but then ongoing, I think we should have regular meetings so that we have know what that is. And now Mike is full time with me. He's got more flexible hours than I do. There may be times where I can't be in a meeting, but Mike can be on a meeting, and I can listen to the recording later. And so, um, I trust Mike explicitly with the direction of our company, where we're going and that. And if there's obviously a question you gotta ask me, you gotta wait and ask me, I, I get it. Um, I, I'm excited about our future, and I'm, I'm excited about it, not from a place of, I sure wish this works out. That's, it's not that kind of a hope that I see, um. And it'll be very lucrative um as we as we marched down that road. So I don't have anything else to say. I could keep talking because I'm a talker and I just keep talking. Yeah, that sounds good to me. Uh, just, just, just want to say thank you so much for your time and effort to give us so much additional information. So yeah, I'll, I'll definitely get back to, to Chris to discuss about the, the scope of the of the MVP and discuss further about about the time and the cost regarding the new information we acquired. Right, and I know some of that's gonna be, you're gonna want to see the Excel, look at the formulas, think of that, cause it's gonna be part of your calculating what it does. Um, once you guys come in agreement, give me some sort of a ballpark on Tuesday, and then I'll send the recording is now, but I'll, if, if we're moving forward, then I'll, I'll I'll give you a copy of the Excel tracking, and you can slice and dice it and make Julian fries. Yeah, that would be great. OK. Awesome. So with that, thanks, Arthur and um Mike, I wanna end the recording on this, but then you and I jump on a different meeting because we got some other confer truck stuff to do. Sounds great. Well, great to meet you, Arthur. I really appreciate it and look forward to. Working together, hopefully. Yeah, it's nice to meet you too, Mike. Yeah, and, uh, Arthur, get some sleep. Yeah, I definitely do. All right, well, thank you so much, Mike, we'll talk, we'll talk to you in just a minute, Mike. Yeah, sounds good. Bye see you."}