{
  "date": "2024-04-25",
  "title": "KPI Analysis Project Discussion",
  "participants": [
    "Arthur Jin",
    "Chris 'Tico' Antico",
    "Dave Schedin",
    "Mike Cooper"
  ],
  "transcript": [
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:01:33",
      "text": "Are you there? Well, just check, and I can you hear me, Chris? I put in the chat. Hello! Hello! My microphone! Hello! I am."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:01:34",
      "text": "Very fun."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:01:37",
      "text": "I just sat down. Hello, Dave!"
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:01:41",
      "text": "Hey, Chris! Great to see you again."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:01:43",
      "text": "Good to see you, too."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:01:46",
      "text": "So Mike's gonna join us. He's might be a little late joining him, but he'll join us."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:01:53",
      "text": "Okay."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:01:54",
      "text": "And that is Arthur joining us too, or."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:01:56",
      "text": "He is."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:01:59",
      "text": "So school, are you guys done with school then, or."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:02:03",
      "text": "Next week. Crazy to think that there's only a week left."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:02:07",
      "text": "Right."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:02:09",
      "text": "Notably, though. should not have taken a bite just before I was about to start talking. The entire remainder of this course is all career support. And so it's all like, let's polish your resume. Let's teach you how to do interviews. Let's show you how to how to how to do a job search. And so here I am going. T hee! Dave and I have something cooking up. We are very excited that perhaps we get to bypass the whole job search to work on this instead, I think that an incredible and valuable opportunity."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:02:44",
      "text": "So let me tell you a funny story about when I graduated Arizona Automotive Institute. and they helped me with my resume. And this is all you know. typewritten stuff. There's no Internet, there's no nothing, there's no computers. And and that. And so I graduated and and they put down my resume, they said, well, tell me all the places you work. Well. I worked here at a warehouse store and admire warehouse store, and I worked@aymca. Volunteer became a job, and and then I worked at, you know, a shell station pump, a gas, and you know I gave him like 5 or 6. And so he, okay, we'll work on your resume. Come back tomorrow. We'll have it for you. And I look at it, and it's got these really nice worded ones in the the where I pump gas. They put me down that I was a petroleum displacement officer for the Shell Oil Company."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:03:38",
      "text": "I like it. I like it. It's good."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:03:40",
      "text": "And so I get home. I graduated when the the union broke for the automotive mechanics in the area. And so I'm applying for job when you know. 10,000 are applying for jobs. And anyway, I applied. I handed it to a a dealership in Washington Toyota dealership, and he goes. That's pretty creative, he goes, he goes. Did did you write that? I go? No, I can't take credit for that. My my counselor at the Arizona Automotive Institute did he goes? I'd hire you on the spot just because you're honest. So many people take credit for that."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:04:15",
      "text": "Oh, that's hilarious! Hello, Mike!"
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:04:18",
      "text": "I had another friend of mine. He was, you know, when I got back he was fresh out of a different school, and he needed help with his resume, and I said, Let me help you. Where'd you work? He told me all these places, so I put down that he was a bovine discus rotational officer for the Mcdonald's corporation. He goes. What's that? And I go? Well, what's bovine? It's a cow disc discus rotational officer, you flip Burgers. anyway. That's pretty funny."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:04:46",
      "text": "You should see some of the bullet points on my resume. They are wild. They're like this is as many buzzwords packed into a word salad as possible, and like that's the feedback I'm getting is you need more of those. Forgive me, Code Smith, but I disagree with quite a few of your recommendations on how resumes should be written. But nobody talks like that, and, like every single bullet point is this like wild amalgamation of jargon, all right great to see you, Mike."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:05:16",
      "text": "Hey? How's it going, man?"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:05:17",
      "text": "It's been a little while. How are you doing."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:05:19",
      "text": "Doing, great doing, great."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:05:22",
      "text": "Going. Hi, Arthur! Great to see you! I hear you got only a week left on school."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:05:27",
      "text": "Yes, we're almost till almost to the end, and great to see you, Dave and Mike."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:05:33",
      "text": "See ya."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:05:34",
      "text": "Yeah, sorry I couldn't be there for the last meeting. It was definitely a scheduling issue. I did not have it on my calendar, and then, when I found out about it, it was too late."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:05:43",
      "text": "Yeah. No worries."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:05:44",
      "text": "Okay. So the goal of today's meeting is to discuss the finances and the cost of the project."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:05:51",
      "text": "Yeah. And then so maybe even a little bit of a scope of like timeframe. What does that look like? You know? And Mike and I were talking earlier today about the scope of what does it look like? In the launching sequence, generating cash, flow sequence like, is it. you know, create it all, launch at once, or launch it in stages, and that, too. So whatever makes sense for you know, however, the project needs to move forward in that. But so with that, I'm gonna let you guys, you know you, you know, you kind of know our our outcomes, what we're looking for? And that so what does that look like."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:06:31",
      "text": "Yeah. So Arthur put together a brilliant pitch deck here for what the actual platform is, and the various stages that we would be building this at, and then how we would initially be released to you, and then, therefore, the public should you choose to do so. and assuming that that is what the intent here is. But the the first, st let's recap what the actual pain points are of the computrek existing system. Right? And so there's 3 major pain points that we've identified, and that is that it is a manual time consuming process that has limited growth and transformation, and that is difficult to maintain. None of this is particularly new. I think we're all pretty familiar here that the amount of time that it takes for you to spin up a new shop, or to maintain an existing shop, or to update your your platform from one year to the next, is large, and it is. It's explicitly preventing growth of your company specifically because of how much time it takes and how unmaintainable it is at the current moment. And so the solution here is to build a web-based Kpi and analysis platform. So the idea here is, instead of doing manual excel tracking, we would have a cloud-based web platform that is hooked into ais or sorry Apis. So that way we have seamless integration with both the cloud-based systems. And then, later on, at some point once we've achieved getting Apis working with the cloud-based systems. We can work on doing legacy integration for shop management systems that have the servers located at the actual shop. I imagine those are going on the way out. It's probably dealerships that have databases that are located locally. I think most mom and pops are now moving to cloud based systems. I know Mitchell is moving to that in that direction as well. And so the number of legacy point of sale systems is diminishing. That might be something that we just choose not to do at all, because if it works for mostly cloud based systems that might be part of the training that you give to shops is to say you, you want to do the best you need to get on the best software move to a cloud based platform. But probably the most important segment of this is the real time, performance, monitoring and analysis. The idea is that if we have the Kpi metrics from the shop management system. In a cloud-based system. We can build the charts and the graphs that would allow us to visualize what's happening within a shop. and then do the next logical step which is to embed AI into the conclusions that we're generating from from that analysis. So the key features that we would want to achieve in the production end goal is that when this whole thing is finished is that we need a point of sale system integration with real time, interactive dashboards and coaching suggestions that are either generated by AI or by a coach that's monitoring the AI system, or sorry monitoring the system on behalf of the shop that has performance forecasting and a planning system, and that that would include things like smart dispatching of vehicles to individual workers. Planning system here is a bit vague, because I imagine that that's a bridge that we need to cross later. Once we have the foundational piece set up where we have the actual data from the Api located on a on a web-based system that somebody can actually log into. But there's a lot of room for what direction we take it."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:09:48",
      "text": "Let me speak that for a second, because part of the point of sale or the the dashboard form is to know not only the numbers, but compared to the forecast they've done, how close to forecast are they? And so the forecasting and maybe I'm going to make sure I heard you right. It sounded like, maybe the forecasting planning would come later. That forecasting. I'm not sure what the planning context is, but the forecasting is, hey, we've got this money tax their efficiencies here. They should produce this this month. Those are numbers that I'll need right away inside of it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:10:23",
      "text": "Yeah. So thank you for the question, because you're absolutely right. The forecasting would come first.st It's the planning system that I think would come later, and that's like, how do we smart dispatch a vehicle, knowing what we have in the data? Who should be getting this client who should be getting this customer."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:10:39",
      "text": "So probably a better word might be sorry to cut you off there, but a better word might be the workflow system."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:10:45",
      "text": "Okay."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:10:46",
      "text": "Make a note of that. anyway. Thanks for that clarity."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:10:52",
      "text": "Yeah, no worries, but also that this needs to work for multi location and have data for regions. for shops and then for employees, and then preferably additional layers that we could go down into, such as customer segments type of vehicle. You know that type of thing. But we would start by saying, we have regions which are multiple locations. We have individual locations where you have the forecasting, and then you have forecasting for individual employees. So the 3 tiers would be where we would start with, and then from there expanding to additional tiers, I imagine, is routine work, and not necessarily reinventing the wheel, because once you've got it working for a location, it's not that much. It's not much more difficult to make it work for an individual type of vehicle. For example, it's just filtering at that point. Okay, so the product plan roadmap that we've got set up is for a 3 tiered release with 2 tiers before we go into the production phase. The demo phase is Arthur and I's estimation on what it would take to get an incredibly rough looking demonstration that the end goal is achievable. This would be a functional prototype with some core features that has minimal operation costs with a half salary for each of us. So the agreed upon salary that Arthur and I have come to the conclusion on is that it's be about $100,000 per engineer that is working on this. We are both willing to do this demo phase at $50,000 a year. So essentially for these 2 months, we would just be getting paid, whatever that math would be."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:12:28",
      "text": "Right, but."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:12:30",
      "text": "This is to validate that what we're attempting to do is achievable. This would be use hopefully if you have it available to us, use an Api from an existing shop. Take that data, put it into the database engine that we we choose to use. I think we're probably leaning towards SQL. But it's possible that we might go with Mongo doesn't matter. we would take the data from the Api, put it into the database, build an analysis platform that's built on top of it. So you can see the forecast. This would be quick and dirty, would not look pretty. It's obviously not ready for consumption in any capacity. But this would be the proof of concept. The Mvp. Phase would be where we take this demonstration, and then we expand it so that the core feature set is fully complete within this Mvp. This would also allow us to have the cloud-based integration with the Api for a single Api type. So we're not planning on casting a wide net here, saying like, Let's make this work for mechanicnet and techmetric. Actually, I can't even remember the names of the."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:13:34",
      "text": "Software Mitchell and."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:13:35",
      "text": "Right. Let's not make it work for 6 of them. Let's just pick the one that you have the most number of calls. Make sure it works there and then. That would be. You know what we do in the Mvp. Phase, and then the production phase would be an 18 month time period after that to build out all of the user interface, the functional front ends and having, like a finished, polished release, releasable product."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:14:01",
      "text": "Okay? And then so the 3 to 6 month. what is is that? What's the cost of that? Is that at still 50%? Or is that a full at that point."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:14:12",
      "text": "That would be full at that point. But there's another slide later on. That will go over the costs for each one of these sections. Yeah."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:14:17",
      "text": "Whether it was."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:14:18",
      "text": "Oh, sorry about that!"
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:14:20",
      "text": "My! My only thought, as far as the management systems go, is it's it really narrows it down to say just one off the bat when we know shopware and tech metric or the top 2, and then you've got a few people on Metro, don't you, Dave?"
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:14:36",
      "text": "Yeah, I've got actually got more people on Mitchell than anybody else. But that's the legacy. you know, server base. I've got a few on protractor but tech metrics and shopper are my predominant ones. and I and I know right off the bat. If I approach 2 people they would have no issue at all doing it. One of them is going to be dynamic Diesel, and they're on tech metrics, and it would also be Mike Corbin from smart service. He also would be willing to be the the test guinea pig on it."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:15:11",
      "text": "Any software tech metric as well."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:15:13",
      "text": "Tech metrics. And the reason I want to do maybe a combination is because smart services got 2 locations. So then we can do 2 location functionality as you guys are building the base platform of what that looks like together. And then dynamic Diesel is a singular outlet. And both of them are very open to copy, check, and what we do for all all the so many different reasons. But but they would be open to, so would it be? Would it? Would it be better to start with a 2 location shop single, or do like? In a sense, both of those together."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:15:54",
      "text": "If you can get it working for a 2 location shop, then it like inherently confirms that it would work for one, since it's just half the data. So doing it for a single shop that has 2 locations would be like an ideal test case. Here."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:16:08",
      "text": "Okay? So that's So the smart service would be the the 1st choice. Then to go with."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:16:14",
      "text": "And we're okay with just one management system. To begin with, Dave."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:16:18",
      "text": "Well, yeah, I think in this, because I think the I think my understanding crystal you described it in past meetings is that that the Kpi numbers are the Api numbers. We're gonna go get. It's gonna be different. Every management system but our dashboard, everything we do. We're going to pull those numbers in to fit them. How we want."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:16:37",
      "text": "Yep."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:16:38",
      "text": "And anyway, so, so."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:16:40",
      "text": "So notably, Mike. The demo phase and the Mvp phase are where we're only relying on a single management system moving into production. Phase is like, Okay, now we need to go. Make sure that this works, for, like the 10 top 10 shop management system that Dave has his clients, and that would then require doing the work. So like once we've got it working for a specific shop management system, we go mirror those efforts in each subsequent shop management system that we want to import."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:17:06",
      "text": "Perfect."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:17:08",
      "text": "Okay. Arthur, was there any other comments that you'd like to make on this page? If not, I'll move on."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:17:14",
      "text": "Not really just wanting to mention that. The reason why we we choose only a a as Chris just described the reason why we choose choose only 1 1 client to be our Mvp. Target is because they're probably dealing with less number of of the of the poll system we do from from our research and experience. It's gonna be a very complicated work to make the, to make our our app compile to the other to to other post system. So it's gonna take a lot of time and just to examine if it's gonna work for one for for one client, we're just gonna deal with the single client with one post system at the 1st time, and then we'll be able to expand to others."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:17:59",
      "text": "Yeah. okay, so the key features that we would want to achieve in the demo. So keep in mind. That's this, 1st in 2 months. What we try to achieve here is that we want basic authentication. So people have the ability to log in that. There's a simple dashboard that has the Kpi displays on it. We have manual data entry and basic data storage. So what the Api results send to us, we have the ability of collecting and the manual data entry is on this list because we don't know if the Api is going to have all of the numbers we need. I imagine, Dave, you have a lot of metrics inside of your spreadsheet, and the Api is probably not going to have all of them, so we will get the ones we can, and then ask people for the ones that we don't have. Kpi sample visualizations is essentially like, okay. Now that we have the numbers in here, can we make a forecast based on the numbers we have today? What are we expecting them to see at the end of the year? Or, for example, what is the current average number of hours that we spend, per, you know, forward for employee number 2, something like that. So some sample visualizations, notably this is not meant to get all of the visualizations on here. It's just that if we can get one or 2 working on the screen, then that means that we can build all of them right. Does it look the way that you want for this one visualization? Because if it does, then we can put 100 there."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:19:16",
      "text": "Right."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:19:16",
      "text": "We need the sample data integration. Now, we wrote sample here because we weren't sure whether or not you would have the authority or the ability to get us data from an actual shop. So we were testing. not testing. That's not the right word. We were assuming that we would need to build this with fake data. It's even better if you have a shop that we can use this on. Because then we don't need to use sample data integration. We can go straight to real data integration."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:19:36",
      "text": "Yeah, I'm I'm pretty sure that they'll. They'll allow us to go and get live data."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:19:42",
      "text": "Awesome basic data cube operations. A data cube is essentially what you're asking for at the end of the day. Here, Dave, without going into too much technical details on what a data cube is. It allows us to filter and pivot the data that we're looking at much like you would in a pivot table in Excel, but on the web. So show me the sales metrics for my shop. Okay, now let's do it for fords. Let's do it for Fords for Jerry. Let's not do it for Jerry, but I still want to see on Fords. But let's add another shop in here, so we can see to get across to, and those become very easy and fast to do, because the data cube contains all of the endpoints that you would need to calculate. So you can just filter against it on the front end so essentially at its core. What we're building here is a data cube. So the goal here is to have basic data cube operations so that you can filter and navigate the sample visualizations that we're trying to build."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:20:35",
      "text": "Oh, good!"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:20:36",
      "text": "Additionally, we're going to be building a basic responsive web application interface. We are not making a mobile platform unless you explicitly tell us right now, hey, this needs to work on a cell phone because that changes the goal quite dramatically. If you need this to work on a phone, we are now talking about designing this from the ground up so that it's touch responsive so that it works in a tiny screen so that you can have like swipe functionality and that type of thing. It makes things significantly more complex to design and develop what we mean by a basic responsive website is so that it works on small monitors and on large ones, on tablets and Tvs. And it'll look responsive, regardless on each of them. But we are not building. let's see, say otherwise we would not be building a touch. Sorry a mobile application."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:21:24",
      "text": "So let me speak to that for a second, so I can say that there's quite a few shop owners who, when I meet with them. They're pulling up on their phone. They're point pulling up a dashboard that they're getting to work. And they they live from that. So there is the phone aspect of that, the other phone aspect of it. It would be down the road when we build the dispatching tool that the that there would potentially. There's going to be an integrated time clock with it, too, and the tech would need it on his phone or her phone."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:21:56",
      "text": "Hmm."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:21:57",
      "text": "So that"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:22:00",
      "text": "Well, I won't say that the door isn't open to go down that road, but that it might be. or separation of concern to try and build both at the same time. Now, now it is factual that if you're building a platform and you want it to be mobile, responsive, you build it as mobile, responsive, first, st because if it's mobile, responsive, then it'll work on a web browser that's not mobile, enabled right? Like. So you build it so fits on a cell phone screen, and then it'll work on a wider monitor. And so there is validity to building it 1st in that capacity. But if you don't need all of the functionality in a mobile app, then maybe it makes sense to build the platform 1st on a web platform and then make a mobile website for the specific functionalities. So this might be, computrek.com is the web platform. But if you go to app.compute.com. Then that has just the time clock or just the graphs. So you can't enter data there. Or maybe that's exactly what it's supposed to do. Maybe that. That's you could go there specifically to enter data. But it doesn't have the full complexity of like user account management and changing billing information and."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:23:04",
      "text": "Right? Right? I agree with that. So I would want that more of a just as a basically a looking glass into the the whole platform."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:23:14",
      "text": "Okay, okay. So keep in mind. This would be Demo for the 2 month plan. I don't think that that would make sense unless we were to expand. How long it would take for us to do this, Demo, but I I don't want to discount that. The mobile responsiveness might be Part of Mvp. Scope, or or certainly in production, if not part of Mvp. So how would we define the demo as a success if we have a functional prototype that has these core features in there. It is demonstration ready has basic user flow implementation. The core technology tech stack that we've implemented has been validated, and that the initial data model is also validated. What we mean by validation here is that the technologies that we've chosen are scalable to the size that we need, that they functionally represent what it is that we're trying to achieve. and that they help us achieve those goals, and that the actual database contains the elements that we need to in order to count the metrics that we're actually attempting to do."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:24:13",
      "text": "So let's talk. Speak a moment to scalability. Scalability to me, minor. My definition would be not only number of users, but then scope of what can be on the on the dashboard, or than what's tracked."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:24:32",
      "text": "Yeah, we would be building this with bank level software using a tool called redux for state management. which would allow for hundreds of thousands of simultaneous users. And if you're using a data cube, there is no lag time between when you click to see the data and when it's presented, regardless of how many users you have or how much data you have, because the computation time required to generate the data in the data cube is done. Offline after hours. you know, on its own separate server. And so getting data out of the data cube becomes instant, no matter how many users there are, but populating the data cube might scale over time with how many people there are."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:25:12",
      "text": "So with that software, we'd have all our ducks in a row right."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:25:19",
      "text": "With that thought, you're probably going to get to this near the end. I'm assuming that besides the salary that you guys are proposing. There will also be an additional cost on the server services, or something."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:25:32",
      "text": "Yes, sir."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:25:32",
      "text": "And that will be covered later on."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:25:34",
      "text": "Yes. notably those are tiny costs for Demo and Mvp, because we're using a single instance, we can actually host all of it on our local machines initially, and then move over to aws cloud hosting. When we try to onboard 10 clients or 20 clients, or something like that, or what we want to make it production ready. The demo doesn't need to be accessible online to anyone else other than us for and or whoever else you deem was like, Hey, go check this tool out. And so putting it online at this point means that we would be incurring costs that we just don't need to do, because it wouldn't be in a state that's ready for any clients to use it."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:26:08",
      "text": "For the whole Demo phase. There's no cost of."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:26:11",
      "text": "There are some, but they're they're really small."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:26:14",
      "text": "Okay."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:26:17",
      "text": "So Mvp. Is the next step after the demo. Once we validated that the demo is successful, we would be moving into the Mvp. Stage. This was where we would need to add the user management system with basic roles and permissions, such as shop owners, individual techs. Whatever specific roles it is that you guys delegate as like, I need a marketing professional role. And we need a coaching role that has access to this cross-sectional view or whatever it is. And so we would then begin the implementation of the specific user roles so that they have access to the specific components within the tool that we're building. Notably, this is still a single point of sale system integration. The data, import and export would just allow us to say. because Dave had mentioned this earlier in conversations. We want this to also be a platform that other people can use to power their own systems if necessary. So data export here might be a little bit ambiguous. But to me that means that we're building an Api for other people to tap into our system to get our conclusions out. If that's the case, Mvp. Is not, let's build the entire Api connection, but build the skeleton so that we can do. Api calls with validation keys to make sure that you know the people who have access or should have access to the data do have access to it. Data import, of course, is the other direction, us using other people's Apis to get data into our system."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:27:37",
      "text": "Yeah."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:27:38",
      "text": "Kpi tracking and basic analytics. Reporting. This is much the same as we did in the demo for the sample visualizations, but this would be more of the visualizations that we need. Hopefully, we can get a nailed down version of like these are the minimum that I need to be able to display my clients for this to be a functional product for me to say, yes, we have achieved Mvp. That'd be something you give to us, and then we go through the process of making sure that they're all implemented in our system. I imagine that that's also going to be a little bit of a landmine field that we might be walking through in that if we find that the Api simply doesn't have that data. how do we report against it? This is where the manual data entry comes back into play. In that, you know. If if we're trying to report against a value that's just not in the shop management system. We're going to need to ask them to provide it to us."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:28:23",
      "text": "Right, and there's only a few, I think, would be there, and part of that end user. One of them is, you know, the the time clock access of punching on and off digitally. Vehicle like The tech metrics. the smart service is actually their techs are punching on and off their dvi. So we have their actual time, and the rest of as long as they truly are punching on and off. whereas dynamic Diesel, because the time clock is only 75%. What it needs to be inside of tech metrics for true tech time tracking. They're opting. They don't use a digital tech time in there at all. They're using peel and stick flags, which means there's a they have to then go manually, enter in their actual amount on each job, and. I just tell you that's a painstaking thing to do. So there might so tech time tracking would be one of them. and that. And then there's a new feature coming out that it's going to be more and more prevalent. And that's instead of Miles. It's engine hours. And Mitchell has that that data? As long as the shop updates it. So anyway, I probably went down a rabbit hole. I didn't need to go down, but."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:29:42",
      "text": "Yeah, no worries. I I think that's a good example of what might be something that becomes evident as we go through the Kpi tracking in the Mvp. Is like, Oh, wait! We just don't have this data. And then that becomes something that we have to have a conversation about like it does. This need to be part of Mvp. Because it doesn't exist in the shop management system? Or do we move on without that piece and then circle back to it when we're in production phase. So notably, this is still a single shop management system, but would include the appointment scheduling tool. I know that we are not attempting to create a tool to allow customers to schedule appointments, that this is instead, like appointment routing. That piece, I think, needs to be fleshed out a little bit more, but we allocated time to it in this Mvp. Because we know that you had mentioned Dave before, that this is a very important part of being able to assign work orders to specific employees based on the metrics that we have access to in the Kpi dashboard. And then so service advisor performance tracking is, let's make sure that we have the Kpis for the location. But there are specific metrics that are only applicable to service advisors. And so in the demo we may not necessarily have a page specifically for advisor tracking. We just have to have Kpi numbers for locations as a whole. In the Mvp. We would be building the specific dashboards that are required for individual employee tracking."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:31:01",
      "text": "Okay? And then this would also have the dashboard with the data visualization."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:31:06",
      "text": "So what defines success here? Well, having the core feature set as complete, having the point of sale, integration working. having a system stability achieved. This would be making sure that we're passing testing validations and that we don't have a buggy system. The buttons do what they're supposed to when you click them, and that we have the basic analytics as operational. Can you tell the number that you need to do? Do we do the things that we are supposed to. I wasn't. I wasn't articulated. Very well. Do we have the metrics? We need to show when somebody is attempting to see those metrics."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:31:43",
      "text": "Can we perform the analysis."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:31:46",
      "text": "Okay, so let's talk a little bit about budget now, because production is the Polish layer that goes after this to say, okay, well, we have 30 out of the 100 metrics that we need. Let's call that Mvp. Complete. Let's go work on the other 70. It's difficult for us to say what the key features are of the production environment, because we imagine once the demo and the Mvp. Are created, a new conversation needs to be had about where the direction of this platform is going. what work needs to be spent on what do we prioritize adding additional shop management systems? Or are we prioritizing, making the existing shop management systems, we have more polished. And so that's a conversation we should have down the road. In the meantime, though, we should talk about what the cost factors are for the Demo and the Mvp. So here's a generalized bullet point list of the 3 categories that we have, which is infrastructure operations and development development is largely our salary and outsourcing for specific niche works. You know, I'm starting on the bottom here, but niche works that we may want to outsource is system design. For example. we can get an out of the out of the box off the shelf solution for relatively cheap. But if we wanted to have something custom and bespoke for Computrek, that would be external costs that we would need to bring in a specific expert to do those specific design works. That, said Arthur and I are pretty good at Css. You know we we can make it look pretty good. But if you want production, professional level design, then perhaps it would make sense to bring in an actual designer for that type of work."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:33:17",
      "text": "I, you know I'm pretty sure you guys probably do it, but at some point it'd be nice to be able to have you know the dashboard that they're not only has our logo, but it has the shops logo. that there would be some customization per to their culture and environment, so to speak."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:33:34",
      "text": "For sure, that's absolutely doable."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:33:36",
      "text": "How do you feel about like having the dashboard reskinned to use the colors in their logo? They upload something blue and red. The system looks blue and red."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:33:45",
      "text": "Yeah, that's cool."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:33:47",
      "text": "Okay, I'm just gonna keep that in my notes as like, hey? Maybe we can surprise Dave and Mike with like, upload your logo and it automatically recolors. That might be a cool thing to do in the future. But yeah, extra stuff like that. Probably not wise for me to start suggesting that we. We can add that at this point, but."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:34:03",
      "text": "I get it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:34:04",
      "text": "Yeah."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:34:05",
      "text": "We've also got the the concept that there may be other coaches that will buy into our system. and they didn't want. They may want all their shops be branded under their code system."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:34:19",
      "text": "Yeah, okay."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:34:21",
      "text": "Yeah."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:34:22",
      "text": "So operations costs include monitoring backup, a content delivery network and support technical support to users is not something for the engineers to do. And so when you transition out of Mvp and into production, there needs to be money allocated for someone specifically to do support work."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:34:40",
      "text": "Okay. And what are we looking at? I want somebody who and I mean this most respectful way, because most of these shops are going to be American, somebody who is, if anything, bilingual, American and Hispanic are the most popular ones. In fact, this last 4 months I ran into more Hispanic speaking shops potentially interacting with, and some of them the text don't speak hardly any English at all."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:35:07",
      "text": "Thanks."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:35:08",
      "text": "So it'd be nice to have multilingual as well."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:35:13",
      "text": "Yeah, that is certainly a bridge we would have to cross later when we're ready to begin offering support. And that's when you transition out of Mvp. And into production a conversation about what that support costs. We put a figure $36,000 a year kind of minimum. I don't think you would be able to find a support agent who would, who would be willing to take less money than that. So as a rock bottom, I think that that would be. What is the cost requirements for one support agent to support this platform? The good news is, you have Arthur and I to kind of shore up the stopgap in doing support initially. But we don't want that to be our focus at all during this project is to support our clients while we're trying to build this thing."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:35:50",
      "text": "Well, I get it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:35:52",
      "text": "Content. Delivery network is for, like Ddos, protect protection, ensuring that localized files are accessible in the regions where we're doing business. So, for example, if you've got clients in Canada and in South America, we need to have the data cube replicated and located nearby on servers that are accessible to them. So that we're not doing large transfers of data to multiple parts of the country or the world. I suppose additionally, backup would ensure that we have the accessibility to the data that we have the ability to do recovery, that in case any servers go down that we have. you know, replication layers. it's relatively affordable. But backup is kind of a necessary requirement for any large scale. Application like this, and then monitoring is visualization. Into how much memory are we using? What is our storage space capacity? How much CPU throughput are we? Are we putting on the system that kind of thing. and then infrastructure is the actual storage, the actual testing and quality control environments and the actual Dev tech stack that we would be paying for."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:36:59",
      "text": "Okay."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:36:59",
      "text": "The majority of the technologies that we have picked are open source and free, but some are not, and we might choose to use some that are better suited for the task at hand, and then we make the initial investment into it. But."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:37:15",
      "text": "What's the security liability for an open source platform? That's free versus a high protected security protocol, I mean, like, when we get all said and done. I want to be hack free."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:37:29",
      "text": "Yes, no. That makes sense. Yeah. So open source is like, the source code for the tool is available online. which means that you have the benefit of having millions of developers looking at that source code anytime that they want to deploy it or use it in a system, and that they call out inaccuracies or problems, and it also has the benefit of any time that there is a vulnerability. It gets fixed very quickly because you have so many eyes looking at the system. Open source does not inherently have any security drawbacks. As a matter of fact, many of the tools that we're choosing to use, despite being open source, are used in like banking infrastructure, like redux, for example, is an open source tool. Actually, I don't know, Arthur. Can you fact, check me on that one is redux, open source."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:38:16",
      "text": "Yes, it is."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:38:18",
      "text": "Yeah, so like, that's used in banking environments. So it's an incredibly secure platform used for state management. But it just happens to be open source. I don't think that there are any security concerns, but for the specific elements that require security like user authentication, none of that code would be written by us because we don't want to be responsible or any security maintenance. We need dedicated specific teams who have explicitly dedicated their lives to doing things like password Hashing to generate the tools that we use to facilitate those. And so we will be implementing their work, of course, but we won't be writing any of the original code for things like user authentication, or, you know, like the Https Network Protocol, or anything like that."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "00:39:02",
      "text": "I think, when it comes down to it, too, Dave. Just a clarification. As we commonly say, locks. Only stop honest thieves. Something's always hackable. It's just how much. And I I would echo much of what Chris is saying. There. you've got these pieces you can use that are well thought out."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:39:29",
      "text": "Okay. Awesome. Alright. So for the budget planning, the demo we have estimated is about $18,000 over 2 months. The Mvp. Is closer to 90,000 over 4 months, and the production phase is about a half 1 million over 18 months. Amortized. Cost for this would be about $9,000 in month, one and 2, $22,000 per month for months, 3, 4, 5, and 6, and then roughly, $30,000 a month for months, 7 through 24. To get this completed."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:40:03",
      "text": "And that production, one that covers the the infrastructure, operations, and development, all of that, in a sense."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:40:12",
      "text": "Yes."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:40:13",
      "text": "Yeah."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:40:14",
      "text": "I have another page that I can open up that has the detailed breakdown of each of these if you're curious. But the way that this is structured is that each of these would be bought separately and independently from each other. in that they do need to be bought in in order, so we can't get to Mvp. Until the demo is done. But we would use the break point in between the demo, the Mvp. And the production as an opportunity to reassess the scale, the scope, the direction, and so on. For what the project has, what parts of the project have been built up to that point. So the demo would be a 2 month sprint by Arthur and I to get, as I mentioned, the core functionalities up and working so that there's a proof of concept for the tool. The Mvp. Would be to round out the function set, and then that would take us about 4 months after the demo is completed in order to achieve, and then the production would be the ongoing costs to build out the rest of the functionality, build the user experience, add additional shop management systems, so on so forth."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:41:16",
      "text": "So just real quick on the Mvp. Cause. That's when we start heading into the 100 grand salary. so 100 grand, divided by 12 is 8,300 times 2 of you. It's 16,006 60. How did you get to the 22, 9, 42."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:41:38",
      "text": "Yeah, we're talking about Mvp phase here. So infrastructure costs. operations and development development is actually only 66,000 for the 2 of us. This is a hundred $1,000 a year for 4 months times 2. It's actually only 66 going to us. The Ui design would be the outsourced function. If you guys don't want to do outsource ui design, we could shave off 10 k. Right there just by doing the ui design by us. But that might inflate the time by just a wee bit, because now we have to do design that we were planning on outsourcing."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:42:17",
      "text": "Okay, so this is what I wanted to see. Then the the difference of what the difference is in there. Okay."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:42:21",
      "text": "Sure, sure."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:42:23",
      "text": "So can you. Is this like an excel, then, or."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:42:28",
      "text": "This is a website. If you would. If you would like. We can give you this document, this link. You can see."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:42:35",
      "text": "Link of this, or we can migrate this this tables to the excel. If that makes more sense to you."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:42:41",
      "text": "Would you like it? I think so."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:42:43",
      "text": "Yeah, I just put it in excel, because then I can do some slicing and dicing myself. And."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:42:48",
      "text": "No problem."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:42:49",
      "text": "Because a part of it I want to look at percentages and ratios and some other numbers that go with it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:42:55",
      "text": "Sure."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:42:57",
      "text": "So let me take a quick preview here of anything else. so I'll probably have more questions, and once they we do it deeper. I don't really see. See anything out of line, though, Chris, from what I'm seeing, go back to your summary page there and."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:43:24",
      "text": "So so notably that we recognize that there's a bit of a cliff here that gets approached. It's the opposite of a cliff. We ramp up into a mountain. Actually, in that, we're going from 10,000 per month, basically to 22,000. And then it jumps to 30,000. And so by increasing the cost by about 10,000 ish per month, or sorry per per phase, that it does require that there be some sort of how do I phrase this? But you need to be able to afford it."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:43:55",
      "text": "But I get that, I get that. So I'm just gonna reduce it to the ridiculous. So if I take 30,000 and divide it by 500. I need 500 clients at 60 bucks, and this is easily 100 $5,075 subscription. So if I take 30,000, and I divide it by. Say, let's just do 1 70. I need 176 clients paying that to cover the net for the continued initial development. So there's some income generating things that I wanna as we grow this and implement it. what can we do? What can we launch? Who? What can we get right away and and grow and grow that so the price doesn't scare me at all. Chris. I I was actually anticipating a little bit more. But don't tell Chris that. So so yeah."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:45:01",
      "text": "There are some caveats here that I think."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:45:04",
      "text": "Yeah, I was. Gonna say, what are the what are the blind spots that are coming out of this one of them? I wanted to ask, and it's a very open, honest, brave communication. This is your guys's 1st project. So where is it that I would I would want transparency an authentic. Hey, Dave, you know what? We spent an extra 1520 h into this, and we went down the wrong path. This is where we should have gone. This is the true cost of that. And so part of your guys is learning curve. I get that. I'm getting this at a great value as 1st time developers and a great cost, and that, and at the same time, where is it that there's kind of the crossover gray area that it might be your still continued learning curve in creating this and doing that."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:45:52",
      "text": "Yeah, no, that's that's a good question. Notably these numbers are the the lowest, and that Arthur and I debated whether or not we should round these numbers or inflate them by adding, like a 15% potential overage to each of these categories."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:46:08",
      "text": "Yeah, I was gonna add, I was gonna add 20% myself. So."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:46:11",
      "text": "Right. And so we didn't do that. We figured we owe it to Dave to show him what we are assuming is the at costs expense here now, notably, there are some decisions that we made in isolation. Do we want to export ui design and have somebody else do that work right. And so if we're not doing that, and that's in our side, then now we're paying for it with time and not necessarily for dollar amounts. Obviously that would increase the engineering team cost. But we figure that some of these things, like having dedicated technical support in the phase 3 might not actually be realistic. If we're deciding as a group, we don't want to have a dedicated it support in the initial release. We're just giving this to customers as like a beta test and saying, there is no it support. If you have a problem, you're going to write an email to Chris Antico directly. because he's going to have to solve that problem for you, because there's nobody else for you to send this message to, and that might reduce some of these numbers. But we're assuming that these are the numbers that we need. And this means that this is the minimum and not actually an inflated value in any capacity."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:47:10",
      "text": "Right."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:47:11",
      "text": "What can I just mention here, Mike and Dave, is that when we are presenting these numbers to you. this is not a sales pitch. We're not pitching the value of this product. What we are pitching you is the report of the expense for building this product, and we are giving our very, very optimistic estimation of the cost here the the real cost can only be determined on the in the process. We're building this, and as Chris has mentioned. There are some other drivers that may may affect the cost of this. Chris. If you can do me a favor, can you scroll down to the very bottom"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:47:52",
      "text": "Don't forget."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "00:47:54",
      "text": "Like these are some of the estimation, and here are the notes. These are some of the some of the factors that would influence the the actual cost of this project. But there, there is no, there is no need to walk over these one by one. For now we just want. Yeah, we just just want to express that we bring our honest and our responsibility to show you the actual cost, the minimum cost of building this product."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:48:21",
      "text": "Yeah. Now, the good news is that Arthur and I actually have a very extensive support network through codesmith of seasoned engineers that we can use as free consulting for decision making before we make any actual tangible progress in the project such as this is the tech stack we intend on using. What are your thoughts about it? We actually have 40, 50 engineers who would be willing to absolutely give it the 2 h in order to give the review, and that means that we have the added benefit of having the Codesmith faculty as well as Codesmith graduates as well as the Codesmith support network that's openly available at large online to review what it is that we're we're building before we've made inroads to actually build it. And so hopefully, that allows us to mitigate some of these. We took 30 steps down the wrong path, and then we only realized it when we got bit by a snake, and now we've got to one deal with the snakebite, and 2 go walk back 30 more steps before we can make progress again. But 2 is these are really hopeful estimates based on Arthur and I being the only 2 devs. This is certainly a project that is befitting of more than just 2 developers to work on."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:49:31",
      "text": "I? I was gonna ask that question. So at what point have you guys reached capacity? What does that look like for you? Is that a time."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:49:42",
      "text": "Yeah, it becomes a time question more than anything else. 2 developers could build just about anything one developer could build just about anything given enough time to do it. It's more of like, do we want to wait for one developer to build the whole thing. having 2 developers? Obviously lets us split up tasks and have one person working on front end, one person working on back end, one person on the AI integration, one on the cube metrics whatever that looks like, but having a 3rd obviously, is a force multiplier, a 4, th a 5, th and that'll reduce the amount of time that we're working on, although that does bring in its own complexities. In that. Now we have to do much more rigorous code reviews in order to make sure that what's being built is actually. you know how we want it to be built. I have full trust in Arthur's code, and he has full trust in mine, but of course, bringing in a 3rd developer means that now we, we may not have that level of trust in what they build."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:50:33",
      "text": "Not that we would go there at this time. But was there somebody else in your class that is on your radar that you would consider."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:50:41",
      "text": "Arthur, I would strongly vouch for Milti. I think multi is a phenomenal coder. but perhaps, I think, rather than trying to hire another junior engineer. If we have the funds available to do it, it would make more sense to hire a senior engineer to act as lead in this project, because what we have the full understanding of what it is that we're trying to build, we lack the technical experience in the tech stack and the deployment and how to integrate these tools together, whereas, having a seasoned engineer who doesn't know much about the automotive industry might help us circumnavigate some of those problems."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:51:20",
      "text": "So go back to your summary screen, and so just to fathom this. So it's the 17 plus the 91 plus the 5, 24."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:51:34",
      "text": "Yeah. And I have my little note down here. 7, 7, 7, sorry. 7, 7 0 7. Now, notably, this is 634 for these 3 numbers. But we have an estimate, for after this is built. and it's in production. What are the ongoing costs per year for the server storage."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:51:56",
      "text": "The the it support."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:51:59",
      "text": "The aws cloud, computing."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:52:03",
      "text": "Right? and this is this is that. 7 70 is, that's over 18 months right?"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:52:17",
      "text": "No, that would be the full 24 months."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:52:20",
      "text": "Oh, right sorry. awesome! And what is it? So when is it? If we, you know. pull the plug. Say, yep, we're gonna do it. Not pull the plug, but activate it and do it. When is your start? Date."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:52:47",
      "text": "Arthur and I are available starting next week on Saturday. although truthfully, I feel like, after this course, I would like to take a week off, or something like that. But theoretically we could start whenever you're ready. This is not so. The thing is is that for the demo phase and the Mvp. We don't necessarily need to have a company created yet Arthur and I do not have a company in place. We don't have the the setup for it. We would need to do that on our own time. Obviously, that's not your concern. But we would be able to start even without that, because we can go through the process of creating the company after the fact. The thing is is that it's not worth us creating the company until we know that we have this project as like A, for sure, we're going to go through the Demo and the Mvp. The production, we can, you know, like debate whether or not we go through that once the Mvp. Is built. If that's the case, then Arthur and I would take care of the back end in order to like, create the company. In order to do this."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:53:40",
      "text": "And what? What money do you need? To initiate it and start it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:53:45",
      "text": "The 18. Or this. This figure right here, pays for our cost of living. Actually, let me go back into where it is, here, up at the top for the phase one this would give us the ability to spin up a cloud-based development environment, a staging environment, the basic storage that we need for the test data and then pays us the $4,000 a month. so notably that that is a bargain for the developers. We are so invested in actually having this project that we are totally willing to do that for the demo period. It's no problem. But we need to pay our bills, and so we need at the very minimum the 4,000 per month for us to keep the lights on."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:54:29",
      "text": "Okay. And so if I if I initiate it with like 17, 6, or roughly 18 grand and page of that that would cover that we'd be, we'd be covered for 2 months right."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:54:40",
      "text": "You'd get, you'd get the demo. Yes."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:54:43",
      "text": "Good."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:54:43",
      "text": "And even if it takes us longer than 2 months, we would do it. Because that's the agreement here is that you're paying for the demo for the 18 grand. I don't think that it will take us longer than 2 months, though."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:54:53",
      "text": "Right. awesome. I'm just trying. It's not only acquiring the funds, but then the the payment of it. What that looks like and and timeframe wise, and and then the second part of it, the the what's after the Mvp. Phase? What's the dollar amount for the M Mvp. 90."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:55:17",
      "text": "2 roughly."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:55:19",
      "text": "And that includes all those other incidental beyond. Your guys. Pay right?"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:55:23",
      "text": "Yes."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:55:24",
      "text": "And that's a 4 month period."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:55:27",
      "text": "Yes."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:55:28",
      "text": "And then we have. That would probably the 18 month would be then I'm on a monthly basis. But and you're gonna send me that in excel that'd be great to."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:55:39",
      "text": "Yeah."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:55:40",
      "text": "Of that. I'm gonna switch directions here. I I get the excitement of building this program. But why would you guys want to build this software for us?"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:55:57",
      "text": "Yeah, so, Dave, you kind of offered us a unicorn here, which is a pretty notable thing that we haven't spoken about other than verbally. But at 1 point you said that we could keep the source code in order to take this to additional verticals. That is too good to be true. and Arthur and I have had a number of conversations about. Why would Dave do this, and part of me wonders if it is ignorance on your part, or also benevolence, or some combination of the 2. It is too good of an opportunity to build this tool to be able to take this to other verticals, like hotel management, or healthcare or or law enforcement, or whatever it is to be able to replicate this product for an entirely different vertical, that is non-competitive with your own. And so the idea for us to build this for the bare bones absolute minimum, is because of the potential future gains that we could make from taking this elsewhere. Now, of course, that does dictate that at the minimum. That would need to be an agreement that that you're willing to sign to paper that we get to keep the source code at the end of this. But if that is the case, then that is why this is an amazing opportunity that cannot be overlooked."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:57:10",
      "text": "Absolutely. And so it's a. It's the combination. It's benevolence. Because, Chris, I believe in you. And after my short experience of Arthur, I believe in you guys in your direction. And and I get the opportunity here for software. What would you do if you had the license to the software. What would you do with that."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:57:32",
      "text": "Yeah. So I built this once before for the police department. I think I told you about the data cube I built in the past that was so validating to hear from the chief of police. Chris. Oh, my God! We went from not knowing anything to knowing everything all at once about everything that's going on in the city. This is incredible."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:57:48",
      "text": "Right."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "00:57:49",
      "text": "We want to do that here in the automotive industry. Right? We you have the clientele. You have the vision, you know what needs to be tracked. When I was doing this at the police department, I relied very heavily on lieutenants to tell me, like, Yeah, that's a good number for us to track. You are fulfilling that role of saying like, no, we need to know this number specifically for these people in this context, and that is not something that we can have without your expertise. Luckily this agreement ensures that you would be guiding those decisions after it's built here. It kind of opens up this window of like? Where where could we take it to? Where does it make sense to bring this to? It is my opinion that data, visualization and transparency of data is useful in just about any field, but it certainly matters in some fields more than others. such as government spending, for example, or in law enforcement, or or perhaps in healthcare. And I think, taking a tool like this to a public sector environment where, you know, like we could make. I don't know. Imagine having a data cube that has all of the metrics for public health within a city. and we can track whether or not a new installation of water pipelines has reduced rates of kidney stones in an area, because there's less calcium in the water and something like that. I don't know. That would be transformative for that community. Then this would allow us to do something like that. So I supposed to answer your question. I don't know yet, but there's a there's so much potential that I don't know if I can come up with an answer in the moment that I'm very excited about the potentials here, but I haven't really thought about executing any of them specifically."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "00:59:28",
      "text": "So So after the 24 months, what's the ongoing cost from you guys to. you know, hey? I want. I wanna add a cup holder to it. I wanna add it, you know. Upgrade it, you know. Obviously, it's gonna be piece by piece. But what what's the regular like ongoing cost gonna be to monitor it. Make sure it's okay. I prefer you guys be in charge of customer support for it. because I don't want to get involved to the X's and ones, and o's i i that's not me."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:00:02",
      "text": "Hmm."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:00:03",
      "text": "So what's your what's your ongoing beyond this."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:00:08",
      "text": "Yeah, Arthur, I'm not. We."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:00:11",
      "text": "I think I can answer that question. Is that Chris? Would you? Would you exit the the full screen to show your yes. Can. Can you go to phase 3? Let's see the number here. Yeah, you can. You can. You can scroll to the yes, actually, the total, the total budget summary by faces. Do you see the annual cost, the number of like 136 k. That is the money that that is the cost for operating like the cost needed to operate the system after the after the app is built. and that will be that will be the cost also. Since we're since we're discussing about about this, I want to take one step back to discuss about the reason why we are splitting this to a 3 phases. Mainly the reason why we want to give a demo space, and Mvp. Phase is for the con is for the consideration of your position. Dave and Mike is that this is this is this is, gonna be a this is, gonna be a be, a very high opportunity and opportunity always accompany with the risk we know now of. We're we're being fair, that now of Chris and I can 100% guarantee. This is gonna be a success. We are, gonna we're we're we're 100%. Gonna make it. So what we want is to give you the confidence that you can decide at the sec. At the end of the second month to decide whether you want to keep proceeding based on the demo we give you. Then you get another chance to decide whether you want to keep. Proceed at the end of the phase 2, and then maybe at the end of phase 2, we're probably gonna have a whole brand new understanding of the of the of this app. We're gonna have a brand new expectation of the cost and the structure and expand and expanding expansion plan. We probably need way more money than this, but at that time that you don't have to be the only one to sponsor this project. If we, if we come together and have a discussion discussion, realize we see the value of proceeding this project and even make it that bigger, we'll probably more money, maybe maybe millions of money. At that time we can discuss. We can reorgan, restructure, the financial, the the financial composition, or the equity composition of this project at that time we can bring in Vc. Or bring any other funds, and we can invite you, Dave. as one of our shareholders."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:02:49",
      "text": "So. So what what Arthur is addressing here is that there's actually an opportunity for Arthur and I to go to Vc. Funding with an Mvp. That has been completed. If we go to Vc funding without the demo, essentially, all you're doing is you're going to Vc. Saying, I have an idea. and the likelihood that they kick you out of the project is actually relatively high. They say, well, you don't have the experience. You haven't built anything yet, you know you've got an idea. But like, what's your market sector? What's the value? It becomes a mess. If you already have a demo and an Mvp. Built, and then you go to a venture capitalist, saying, not only do we have a work working functional prototype, but we have the market, and we have the access to the market. And, Dave, it's a significantly different conversation. What probably can't happen, though, is for you to go to a Vc. Because if you do, no Vc. Will back you. If you say I'm giving them the source code. they will say, then why am I funding you? I should be funding them instead. But if that's the case, if we do go for Vc. Funding, then an entirely new conversation as Arthur is discussing can be opened up about equity share. And if we are going for Vc. And they're putting in 2 million dollars in order to build this product, then how much of this product is Dave and Mike's."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:04:06",
      "text": "Right? And that's where Mike and I had some conversations around that when you guys in one sense retain ownership of the core program. and we have a lifetime leasing of it. What does that look like as we? You know, we teed up the opportunity for you to get in on a sense, on the ground floor. But what does that look like ongoing? And then what ongoing support? You know it it if it's 136 KA year for ongoing support. That's known. Now, that's only 66 subscriptions at 170. And so some of the other. just and think about it is, and I don't know what the ratio would be. That's why I want to see the excel, but is to take a ratio of of being able to. You guys get a portion of our monthly subscription we collect from customers. and my ultimate goal is to get to a thousand or more. And so, and part of that getting to 1,000 or more, though. Just so, you know, there's still quite a bit of Mitchell legacy that's probably going to be another 5 to 7 years before they go 100 cloud, because their cloud version is protractor. plain and simple. That and Mitchell to move that legacy program into a cloud. You know, they tried for years to make it happen. They couldn't do it. That's why they partnered with with protractor. But part of that would be having you guys part of the revenue to pay for this might come from subscription base that we have. and that. And so obviously, that puts a an onus on us to go build this subscription. Get the number of people in there. What does that look like, and of the monthly revenue to you guys. And for development. the 5, you know the the 5, 24 for the 18 month period. you know, I might, you know. I'll play around with some numbers, but I might counter with some of that 5, 24 will come off a revenue share of. We get to this subscription from here on out. because it's a, it's a viable product. It's sellable. We can present it. It's it's user friendly, easy to get to. People love it. They like the functionality of it. They love the features. But that's a part of the products is it's got to be acceptable to the end user at a high level, and with that in creating that that maybe a percentage of that 5, 24 would come off of subscriptions, and that."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:06:43",
      "text": "It's it's possible. But the concern is that what month in the production phase, do you say that this is ready for people."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:06:50",
      "text": "Yeah, you're right. And so that you know, that's that's and that's why I lightly mention it. Because there's there's too many variables to say it's not a hard line on what that looks like."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:07:00",
      "text": "Yeah."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:07:01",
      "text": "So, and I and I get the. So let's let's open up the conversation then of you, whether it's you or me. We go to somebody. Hey? I got this great idea. I've got 2 rock, solid individuals that I know can create this. And I've got great experience. You know. We need a million bucks. That's probably not gonna happen. you know, and there might be lines of credit that I can get multiple lines of credit to make that happen. But if we actually had, if I funded the you know the the 1st 6 months of this where we actually had that model where we could say, here it is. In the meantime Mike and I are working on. And here's our marketing plan. How we're implementing it. Here's how we're reaching the 280,000 shops that are in America of independence. This is our strategy plan. Here's our market plan. Here's a budget we need for that. And all the rest of that. Now we go to venture capitalist, and I think we have a little bit more of an ability to fund the whole project."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:08:04",
      "text": "Certainly."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:08:05",
      "text": "Does that make sense."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:08:06",
      "text": "Yeah. Arthur used to work in the Vc. Space, and so he was telling me about the difference between having a viable Mvp. Completed before you have the conversation with a venture capitalist as opposed to only having the idea. and that only having the idea does not get you very far in the conversation, but having an Mvp. That works with an Api that you can see the data that you've got the visualization that there's a plan in place for the marketing. Whatever that looks like is a totally different conversation. and significantly more likely to get funding."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:08:38",
      "text": "Right? Yeah. We've already got, you know. No, you know."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:08:42",
      "text": "So so what could happen is you pay for the Demo and the Mvp. And then Arthur and I go deal with the venture capitalists in order to flesh out the product."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:08:53",
      "text": "Okay."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:08:55",
      "text": "And then that would require a more detailed conversation about what the equity split would be, because obviously, we are building a tool based on your intellectual property at that point. But If that's the case, we would then have engineers who have experience on the platform with a working prototype with intimate familiarity with the code base access to a clientele list that's already predisposed to using this type of system pretty much. Anyone that's already been a client of you, yours, or is on the waiting list. To be a client of yours is already a candidate, so there's already market share here, and so it's not even starting from 0. I think I'm rambling at this point. So I'm gonna stop."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:09:40",
      "text": "No, it's good. It's good rambling. It's it's on point, actually. And so I think, I've already my, I'm driven by strategy tactics and angles. and and I'm already trying to figure out the proverbal walk across the room. I see a lot of different venues that could be and and sources for that. So I want to move to conversation. Chris, you gave me you said the you know this could transform communities. That's that as part of the why. It's not just about the buck. It's not just about the money, it's about what the product will do for end user. So, Arthur, what would be your? Why, you would want to create this this software."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:10:27",
      "text": "It's the same rhythm with Chris."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:10:31",
      "text": "We talked about this yesterday."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:10:35",
      "text": "Chris is basically saying saying that reasons representing representing me."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:10:42",
      "text": "Arthur and I have agreed that, you know, after this project is done we don't want to part ways. I mean, like being able to carry this forward into additional verticals or sectors is one lucrative, but 2, a really cool project. This is like, like, not just cool, transformative. It's a transformative project product that can be brought into just about any like like even retail mundane things like grocery stores. This type of data analysis platform is meaningful just about anywhere you can take it."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:11:16",
      "text": "Yeah. And really, what at that point is where you partner with a field expert, a grocery store expert, a plumbing expert. You know the expert you you partner with, you know. And I say this humbly. You partner with another Dave of their industry, you partner with somebody who's who has that transformation mindset that once the numbers to reflect transformation, not drive numbers, so they'll be transformed. The numbers are a result of being transformed and a software that allows them to see what's my next step. I have too many options to do the next step. I don't know what that should look like. Boom! Here's your dashboard. Here's the next 3 things 3 steps to do and get it to that point where it's not that we don't want them to think it's we still want them to think, but we want to give them a hope and a future, and a clarity of resemblance of the results are already producing where they need to go right. You know. awesome. So I've got pretty much everything I need. I'm gonna listen to the recording again. If I seem a little incoherent. You notice that I have a nasal, my nasal overtone microphone."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:12:35",
      "text": "I might also be influenced by a little bit of Nyquil fair."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:12:40",
      "text": "So well. But, Mike, do you have? What questions come up for you on this."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "01:12:47",
      "text": "No, I think this was a pretty solid presentation. Well thought out in in countering the problems and the the current current things we're trying to overcome. So I'm happy with that. I guess I guess somewhat related. Since we're talking about transformation. I'm just curious. If you've been to heart yet or not, Chris."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:13:14",
      "text": "No, not yet. It's the next one that I'm going to. I got a message from."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:13:20",
      "text": "That's coming up in that's coming up in June."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:13:22",
      "text": "I'm staff. I'm staffing it. Yeah, I need to send her a message. She sent me."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "01:13:29",
      "text": "So it's still on your radar. It hasn't dropped off."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:13:31",
      "text": "No, no, although, to be fair, I have totally neglected looking into or doing any planning for heart, simply because the amount of things that are all coming due at the same time."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:13:42",
      "text": "That's all that."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:13:43",
      "text": "Yeah, pretty much. I need to know if this project is green lit, because if it's not, I need to get onto the job market immediately, and that entails practicing resumes and working on algorithms and creating projects that I can put on my portfolio site. It is a monumental amount of effort to go find a job in this economy as a brand new software engineer. And so if this project is greenlit well, then, now, obligations totally shifts. Arthur and I no longer need to prioritize looking for a job out in the market. We can prioritize taking care of what's going on in our world around us, and then also focus on like setting up the Dev environment and working on the the dev, or sorry the the demo version of this project that kind of thing. And so obviously, I'm not expecting an answer from you guys today. But it does change the trajectory of how I'm spending my time. Once I do have that answer from you guys."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:14:36",
      "text": "So have a week to make the final decision. On next Friday."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:14:44",
      "text": "Think you have longer than that. But I would appreciate an answer that quick."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:14:48",
      "text": "Because let me, I don't. I don't want to delay. This is this isn't something I'm gonna stick my little toe in the water. I'm gonna dive off the deep end. If I do it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:14:57",
      "text": "So consider that you have multiple stages here that you can commit to if you want to commit to just the demo initially, that's totally reasonable to us that way. You can see what kind of quality product do we create in 2 months? How much of the demo gets generated? Does it do the things that we said? It does? Does it actually count as a validated, successful demo product in 2 months? And then, of course, after 2 months we can have a conversation. Because if that point you're like, Okay, well, I like what you've done, but I don't have the money to pay for the Mvp. Phase. Well, then, Arthur and I begin the job. Search right? Like right? We could. We could start that process."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:15:32",
      "text": "Let me do this, too. And because I want as a core team, and I get, you guys have your company. But in one sense. We're partnering in this thing together. And because I I love having the same language of success, I would really encourage Arthur, the personal development work that we've been through through Clement associates is to attend to personal mastery because there's some core language there that helps us stay out of it. It gives us clear communication on on a success level. That's different of not going through that. And so I would. It's clemmer.com go to trainings, personal mastery. And where are you located? Actually, Arthur."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:16:15",
      "text": "I'm not in Toronto, Canada."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:16:18",
      "text": "Oh, right! Oh, I think there was one coming up in Toronto. Let me get there. Hold on! I could be wrong."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "01:16:44",
      "text": "Whoever's gonna benefit from that exchange rate bonus."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:16:49",
      "text": "Yeah. So so Toronto is May second and 4, th it's like this next coming weekend."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:16:56",
      "text": "Oh, really is is that is that offline activity."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:16:59",
      "text": "Yeah, in person. It's in person. Yeah, rephrase that offline activity. You can see how deep into development we are."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:17:09",
      "text": "Yeah."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:17:09",
      "text": "It's in person. Yeah."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:17:11",
      "text": "Okay, now, person. And so in in moving forward, you commit to doing that. And then, really, the ultimate thing is, you work all the way through, because the ultimate is is understanding. We're going to set goals and times and dates and really go after this at a super high level, and they really go after intentionality, that what you say you want is it really what you want? You know that by the results you produce, and staying out of victim excuses and just making it happen. And so the ultimate for me. I just got through what's called samurai camp. and I did it virtually, and it was eye-opening again. It's been 13 years since I did that work. but I would highly recommend you guys go through that work to the point where for Arthur, for you. If you go through the the personal mastery and advanced leadership. whatever that cost is, we move forward. I will reimburse you that for the in our monthly whatever, because I think it's critical. For sure, those 2, the heart of the samurai is so powerful to come from a place of purpose driven. Why, we do what we do, and I want to partner with people who know their why, they know why they're in a sense, maybe put on this planet. They know what their vision is. And even if they don't have a clear vision, they just know it's around transformation, or they know it's around. you know. contribution that they just know their purpose, and they don't care what it looks like. I'm just. I'm going to live for my purpose. That's where that's at. And then samurai campus. You set bhags, big, hairy, audacious goals, and you go after a business personal. You go after a business goal, financial goal, a personal goal. And then you go after a contribution goal. Whether it can be time or money, it doesn't matter, and you go after a a self honoring goal. And it really is a place of forward momentum and transform. Because if we're going to build the transformation software. The context that I want to see is people that are building the software are in transformation now, not down the road, but they're in transformation now. So that context carries right into the software so that the end user has that forward momentum of that. If you go to clemmer.com, and you go to at the top, it'll say trainings. and then you click on trainings. There's personal mastery."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:19:58",
      "text": "Just to make sure it's climbber, climber.com."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:20:01",
      "text": "KLEM mer.com."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:20:05",
      "text": "MMEI."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:20:07",
      "text": "A, LEME, MMER."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:20:10",
      "text": "I'll send it to you, Arthur."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:20:12",
      "text": "Okay, I got it."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:20:14",
      "text": "Perfect. And then M, write this down. This is a code. It's 9 95. You. If you give, I give you my code, you get it for 4 95. The code is F, as in Frank 2 8 b. As in Bob, EE."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:20:33",
      "text": "Thank you. Edward."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:20:35",
      "text": "So have 22."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:20:38",
      "text": "Not me."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:20:39",
      "text": "Yeah, f, 28, BEE."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:20:42",
      "text": "Hmm. okay, and that's gonna be in the training summer. I can."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:20:54",
      "text": "Yeah, and in room there when you go they'll give you an opportunity to go to advanced leadership. It's in Texas. We have quite a few people Canadian people that come down all the time. So we do speak in Canadian ease. So you'll be able to understand it because Mike's from Canada. Yeah."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:21:16",
      "text": "There's 1 1 thing, 1 1 restriction about me is that since I'm staying Canada for for getting the 2 years long period to get my my citizenship. I actually cannot leave Canada with the period of 2 years. Physically."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:21:32",
      "text": "Yeah, so he can go to the local training. But he would not be able to go to Texas."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:21:36",
      "text": "Oh, okay, that that's fine. What you can do. If if you want you sign up for it, then you can go to a later date. You get a really good price in the room. If you want to pay it later. It's another 3 400 bucks."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:21:48",
      "text": "Yeah it it. This might change, depending on how Arthur and I structure our company, because if I can get him a Us. Work visa. Then then he's got no problem being in the Us. But that is a bridge. Arthur and I will cross later, depending on how the Demo and the Mvp."
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:22:05",
      "text": "We? We just we just have. I just have a discussion with with Chris few days ago that about about when we discuss about the designing of the company structure. We say, like doing this doing this doing this thing is like buying the lottery, and we don't want to discuss about splitting of money before we win the money. So at the beginning, at the beginning of this project, Chris and I will 100% focus on. Get this Mvp. And get this demo out. After that we will talk about the."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:22:37",
      "text": "The company and stuff. Sure. So I've I've I've got a pretty good strategy right now. So Mike and I are going to talk right after we get off the call here, and we'll talk about it. Well, and I'll need to do some financial sourcing. Some good things have happened in my life to free up an anchor from the past is completely over now, so."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:23:00",
      "text": "That."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:23:01",
      "text": "Divorce in the house sold last Friday, and so I'm out from underneath that bus or that anchor. and that so anyway. So with that. I will send you guys a recording link for this once it converts to Mp. 4, so you'll have it for your records. And then, Mike call me back after this, Mike, but I need him in a bladder brick."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:23:26",
      "text": "Do you think it would be possible for me to have a copy of this recording as well? Yes, yes, puppy."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:23:30",
      "text": "Yeah. That's why I said, I'm gonna send it to both of you guys."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:23:32",
      "text": "Okay, perfect."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:23:35",
      "text": "From. Oh, I miss your dog! How's the how's the puppy?"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:23:40",
      "text": "Afraid of everything."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "01:23:42",
      "text": "Still."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:23:42",
      "text": "Terrified of the wind. Trash, cans, leaves, everything, but still adorable. She's I gave her a piece of salami just now, and that was probably a mistake, because now she's expecting me to have more. He's desperately examining my desk to see where? Where did I hide this lami? But."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:23:59",
      "text": "Yeah, that was, that's good stuff. There."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:24:01",
      "text": "Nope, yeah, Sp is a little little angel, but still terrified of everything."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:24:07",
      "text": "Like."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "01:24:08",
      "text": "Oh, okay."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:24:10",
      "text": "I do want to take a second before we we are actually done here. I just want to recap because this is not actually written down a contract anywhere. Our budgeting proposal is assuming that source code ownership is still maintained between us that can be like a verbal agreement, for now, but before work begins that would need to be concretized in some sort of contract. And that number 2 The goal in the short term is just the Mvp. And the demo, and those can totally be done separately. Demo first, st obviously before Mvp. But that those validate the scope and the scale of the projects. It demonstrates what kind of technical know-how Arthur and I have and would give you guys a better understanding of what the actual production work piece would look like. And so getting the Mvp. And the the demo completed would allow us then to revisit funding for the larger piece, the half 1 million for the whole project."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:25:09",
      "text": "So I'm in agreement with the the code stays with you guys in this process this way."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:25:17",
      "text": "But you would need to drop whatever that contract is, and I'm assuming that a lawyer."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:25:23",
      "text": "What's that?"
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:25:23",
      "text": "I gotta hire a lawyer. I don't know how to write contracts."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:25:26",
      "text": "You'd be surprised how much AI I I throw in there all the time. Now."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:25:32",
      "text": "Valid. Okay."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:25:33",
      "text": "What's a software agreement that somebody's paying me? I get to keep the code contract. What does that look like? And I think from there you're gonna go. Oh, that makes sense. Now that makes sense. I I think you'll you'll catch it."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:25:47",
      "text": "Okay. Understood."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:25:50",
      "text": "Awesome guys with that fly. Be fly and be free. And, Chris, you have a dog. Day afternoon."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:25:56",
      "text": "We'll do."
    },
    {
      "speaker": "Mike Cooper",
      "timestamp": "01:25:57",
      "text": "Alright. See you later."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:26:00",
      "text": "Bye."
    },
    {
      "speaker": "Chris 'Tico' Antico",
      "timestamp": "01:26:00",
      "text": "Your mic."
    },
    {
      "speaker": "Dave Schedin",
      "timestamp": "01:26:02",
      "text": "Hi Arthur!"
    },
    {
      "speaker": "Arthur Jin",
      "timestamp": "01:26:02",
      "text": "Bye, thank you for your time."
    }
  ]
}